[" Failures haunt me all the time.How do I cope up?", " I didn't file a police report for a car accident that happened over a month ago. My insurance company won't pay for damage, what do I do?", " I'm openly gay and falling in love with my best friend I've known for 5 years he's a really great guy but I'm stuck. What should I do?", "\"Every one is unique in this world\", what are the best ways to find my uniqueness?", "\"How do I get rid of acne and acne…?", "\"How to anchor on national youth day\"?", "\"How to crawl data from specific URL (website) in RADIAN6 ?\"", "\"How to improve Project Management skills?\"", "\"How to jailbreak my iPhone 5 ?\"", "\"How to make money?\"", "\"How to move pre installed apps to SD card?\"", "\"How to start \" preparing for GRE?", "\"How to\" fix Google play services battery drain?", "\"How to\" hack citizen calculator?", "\"How to\" move out of a aunty house when she think she own you by raising you?", "\"How to\" start importing goods from China can anyone let me know what legal documentation work need to be done?", "\"If you roll two fair six-sided dice, what is the probability that the sum is 9 or higher?\". How do I go about solving it.", "\"Only two tatkal tickets can be booked from this IP address\" What does this error mean? What should I do?", "\"Passport application is under review at Regional Passport Office.\" Can any one advice me about the next step as its already 15 days now?", "\"The app is turned off by group policy.\" This is the message I am getting when I am trying to access Windows Defender. What can I do?", "\"This Apple ID has not yet been used with the iTunes store. Please review your account information\". How do I get rid of this error on iTunes?", "\"What should I do our parents are refusing for marriage we are from same caste?\"", "\"What should you do if someone is jealous of you?\"", "\"What to do after bsc zoology chemistry?\"", "\"What to do if I locked up my tablet?\"", "\"Why choose a non technical job when you are from a technical background?\" how shall I answer these type of question in an interview.", "\"Why choose a non-technical job when you are from a technical background?\" How shall I answer these types of questions in an interview?", "\"You found a library book and gave it to the class monitor but she misplaced it.what will you do?\"this is my asl topic .please find the answer", "\"how to \"increse spot in india like study?", "\"how to start auto (4 wheeler/ 2 wheeler) repair business\"?", "\"how to\" set ringtone in I phone without itune or computer? Song file is not in my phone", "\"what are good ways to get computer knowledge?\"", "#primavera #p6 how do you apply different cost rates to a resource within a project? E.g. On site cost £30/hr but off site £50/hr?", "$10,000 dollars so how do I take this my adventure to the next level with partners on my back not trusting the process?", "''How to spy my cheating spouse with out there phones''?", "'The girl I like will not like me but the girls I doesn't like will like me and chase me like anything.Correct it please in a good sentence?", "'m currently in my CA finals. I want to start preparing for the UPSC. How should I start?", "(2+2√2) / (1+√2) how to simplify this?", "(NEW Developer) Developing an app with db MySQL consists for few tables. What is the best way to publish the app in Google play store along with db?", ". What steps will you take to promote our company?", ".How to see the trend of second ionisation energy amd calculate their trend? I need only second IE.", "1 month preparation for b.tech 1st semester?", "1. How can only tools, books, and links will help us to make more profit?", "10 ways by which we can be closer to nature?", "10th-9.2 CGPA, 12th- 82%,graduation-72%,graduated in 2016,No work ex.starting my job in Dec. How will it affect my selection in CAT (if I get that far)?", "17 hour layover in Tokyo - what to do?", "19 years old, dropped out of college because of anxiety and panic attacks, my mum is currently sick and recovering from surgery.how can I be happy?", "2 days back a guy snatched my mobile in Bangalore. In my mobile intimate pics were there with my BF. Now that guy is harassing me. What should I do?", "2 priority tasks to be completed in 30 minutes. It's impossible to complete both tasks. What should we do so that both tasks will be completed?", "2 years in to marriage, my wife tells me she does not find me sexually attractive , what can I do? I feel very insecure now.", "2. How To Grow Beard Faster Naturally?", "2003 5.7engine trying to put in a 95 chevy tahoe how to it?", "2048 (game): How do I win 2048?", "20s (age): How can I look more mature?", "23 years old, 180 cm, 120 kgs with 31% body fat. How can I achieve 10% body fat?", "24 years old and never kissed or had sex. I'm determined in finding a girlfriend right now, but what should I do?", "25 Foods That Lower Cholesterol Naturally | Prevention?", "25, M. Everyone thinks I know how to handle finances but in truth I just rely on parents. How can I change this, this late in life?", "25, M. I'm extremely scared of intimidation, confrontation, how can I change this?", "25. I have this feeling in my brain that I am mentally slow. What can I do?", "25.M. I've never been in a fight and know I would run like a coward. I have a huge fear about this and no fighting skill. How can I change this?", "2ish weeks ago I got 2 kittens they are around 6-8 weeks old. They have been doing fine but one of them has started peeing on my bed every night why?", "3 failed shoulder surgeries, now my shoulder has severe pain. What should I do?", "3D Rad: How can I make a mission-based game?", "3M project in Accenture?", "4. how do I figure out what I’m good at doing?", "46 year old male exploring the option of Becoming an Immigration agent in Melbourne Australia. Any advise or tips?", "48% of my iPhone 6's battery life is being drained by Safari app. How can I fix this?", "5. how do I figure out what I'm interested in doing?", "5. how do I find my interests?", "80% of the US will vote using privately owned electronic voting machines. How do we prevent election fraud, if a hardcopy recount isn't possible?", "A 12th pass girl has no money, no place to stay and no relatives in Mumbai. Where can she get a job and accommodation for few weeks?", "A CS major told me to drop out of school because I don't have a STEM major. How should I react?", "A Croatian friend needs to travel from the UK to the US next Thursday. The Visa Waiver Program doesn't cover Croatia so what's the fastest approach?", "A Pen drive capacity has been reduced from 16gb to 4.00 mb. How to regain The actual storage?", "A big misunderstanding occurred between my female best friend and her friend because of me. What should I do?", "A big misunderstanding occurred betwwn my female bestfrnd and her friend because of me what should id o?", "A boy rufused me, how can I continue to keep touth with him.?", "A client who messed up on a deal has promised over ten times by email to send a settlement for the expenses. Nothing has arrived, what can I do?", "A close friend of mine recently died. What is the best way to deal with it?", "A company hired me as an intern and just before the internship began \"nulled\" the offer because their client didn't need me. What should I do now?", "A company verbally offered me a job and I accepted it, I start next week. How do I follow up to thank them and ask for a formal offer letter?", "A company won't give me a full refund for a discount package I bought. Is there anything I can do legally?", "A constant worry about future, parents health is eating me up, I have a good job, good life but in my subconscious mind I am not happy. How to deal?", "A coworker/friend betrayed me. How do I deal with this person professionally?", "A direct competitor of mine in a geographically based service market approached me to buy their business. What should I think of this?", "A disk read error occured on my laptop. How can I fix this?", "A drop of my semen accidentally dropped into the audio hearing area near the front camera of my iPhone 6S Plus. How can I wash it?", "A family member's Quora name is showing up for anything I answer…not mine, how can I rectify this? Her name is Ruthie Smith-mine is Dorothy Uhlman.", "A female friend whom I suddenly have feelings for is in love with someone else. What should I do?", "A free games zone tab opens automatically in my browser. How can I stop it in Google Chrome?", "A friend is depressed, but is not telling me why. What should I do make her feel better?", "A friend of mine at my high school wants to set me up with a girl. We are meeting tomorrow. Advice?", "A friend of mine got accepted by Stanford but got rejected from UC Berkeley, UCLA and UC Davis. How is that possible?", "A friend of mine is going to intern in NCL. She desperately needs accommodation IISER PUNE. Can anyone give me the details of the hostel in charge?", "A friend of mine is showing severe symptoms of depression. I know the reason and story behind it. How can I help her come out of Depression?", "A friend of mine just got laid off. She's in her late forties and a single mom. How can I be helpful to her?", "A friend of mine likes a girl and she likes him too. They want to define their relationship and become a couple but how does he ask her without using the clichéd 'will you go out with me'?", "A girl I know added me on Facebook. We never talk. She seems to be shy and me too. We belong to some group of around 20 people, and I'm the only one she add (no mutual friends on Facebook). I sent her a message after I approved her request, but she didn't reply. what is the meaning of this and what sign is she trying to show me?", "A girl I know wants to straddle me and take pictures to send to her ex boyfriend, \"because it would be funny\". What should I do?", "A girl I liked knew I liked her, and intentionally broke my heart. Then why should I not do the same to girls who like me, but I don't like?", "A girl I love said she wants to be friends with me first before progressing into a couple. I agreed with her and started going out a lot lately, even after Valentine's. She kissed me indirectly and retorted that we are still friends, I'm so confused right now, what should I do?", "A girl blocked me on Facebook. I emailed her to message me on Facebook if she needs any help. She replied saying she does not have internet access at the moment and that she is away from home. What does this situation mean?", "A girl has offered me to ask her a question. What should I ask?", "A girl has used me as a rebound and I feel like I've been tricked and played the fool. Now she wants me to be her friend. How am I supposed to react to that?", "A girl in my class stares at me, but when I look into her eyes she gets startled and removes her gaze and we do not talk. What should I do?", "A girl indirectly proposed me on a day but when I told my love the next day, she took back step. What does she really feel?", "A girl kissed me on my lips after I REJECTED her proposal. What should I do, I am damn confused?", "A girl likes me but I don't like her. What should I do?", "A girl loves me but she is one of my close friends. She proposed to me. But she really is a nice friend whom I don't want to lose because she has been supportive to me as a good friend. I don't like her as my girlfriend. How do I reject her proposal nicely without losing her friendship?", "A girl loves me. Why don't I love her back?", "A girl on Facebook doesn't accept my friend request but still talks to me through messages. Why can't she accept my request?", "A girl rejected me and said she is not interested. But still she talks with me and even likes my posts and photos on Facebook. What should I do?", "A girl says that she's serious about how she likes me, but she wants to wait until it's the right time to be in a relationship. What should I do?", "A girl sits besides me according to roll number. I started falling for her. I talk to her but all of the sudden she stopped talking to me even after I tried to talk to her. Now I also have stopped talking to her. Why did she stop talking to me all of the sudden?", "A girl that I like, who shall remain nameless, has a boyfriend that she met on Kik. I'm really sad now, what should I do?", "A girl used sex as a tool to get my commitment, knowing I wasn't interested in love and now she makes me feel guilty, what do I do?", "A girl who I rejected a long time ago keeps on picking on me, talking about me behind my back and spreading rumors. How do I ignore her?", "A guy I love is unwillingly forced to marry someone, who he introduced at home a year ago. He wants to call off the engagement but doesn’t know how?", "A guy hooked up with me and requested to follow me on Instagram but won't accept my request. He might have a gf too. What's going on?", "A guy in a relationship keeps texting me, I really like him and I think that he likes me but I don't know what to do?", "A guy rejected me and he wants me as his friend. What should I do?", "A guy said he had a crush on me, but when I asked him if he wanted to be my boyfriend, he said he needed time to think. What now?", "A guy says he doesn't love me but time to time he does give hints that he likes me: he loves talking to me, and he knows I like him. So what is he trying to do?", "A guy told me that he had a crush on me, but when I asked him if he wanted to be my boyfriend, he said he needed time to think about it. What now?", "A guy tried to approach me. I ignored him considering him as a creep but I realized him to be genuine a few months later, and now l think it's too late. What can I do?", "A guy who I knew in college recently friended me on Facebook. He is someone who pretty much used and treated me like dirt. I obviously don't want to friend him. Should I let his friend request stay in limbo and not do anything, or should I write him a message as to why I don't want to friend him?", "A legit way of earning money online? I am only 13 tho.", "A long time friend (a girl) asked me out on a date few days ago. And one day before the date, she wont reply my texts or calls. What should I do?", "A lot of people have added me in Snapchat. I cannot add them back as it doesn't show up on the \"added me\" section. Does anyone know how to solve this?", "A lot of startups are constructing robots/drones nowadays. How can I learn to construct the one too and where do I get spare parts?", "A magazine asked if they can publish my blog article. What should I ask in return?", "A majority of the torrent sites have been blocked in India. Which torrent site can I get my movies from? P.S. I'm a bachelor (not working yet), can't afford to buy original dvd's.", "A man I am seeing suddenly blocked me in all social medias we are connected into. I don't remember doing anything wrong. What possibly happened?", "A man said he traced my IP address. How can I keep my PC safe?", "A manager of a local pizza parlor screamed How do I receive compensation for this and is it enough", "A manager of a local pizza parlor screamed at me, the customer, on the phone and called me a \"fucking jew\". How do I receive compensation for this and is it enough for a lawsuit?", "A name shows up on snapchat but I cant add it?", "A new start up, where can I find free platforms that can promote my offers and deals? I do not wish to pay any affiliate commission.", "A number of people have warned for my behaviour to teachers (I mean I appear to be insulting them according to them). What can I do recoup my flagging image in my class due to this?", "A pair of dice is rolled, How do you calculate the probability of showing 6 on the first die or 3 on the second die?", "A person I know has an idea for a mobile application but no skillset or money to build the application. I don't want to steal his idea so is there a widely accepted standard for example where I would take 90% of the profits for doing all the work and he would get 10% for just the idea?", "A person living with us just called me names and said everyone wants me dead. What can I do?", "A place where can spend time with my gf in solapur?", "A pound of frozen meat fell on my big toe. How should I treat my toe?", "A query about hardening of metal using quenching process. To get the hardness of 600 BHN the time span of 10 mins are required and want to reduce the time span of the work without affecting the hardness. The quenchant used is water. What changes should I make in the quenching process?", "A space is being inserted after first letter of some words in a text in MS Word. Eg \"Q uora\" instead of \"Quora\". How do I fix this?", "A spider fell into my open eye. I brushed it off quickly and washed my eye, but it still itches and hurts. What should I do?", "A stranger miscalled me from the private number. How do I find out his number? Is there any free stuff which can help me?", "A student wants me to change her grade because her college admission will be revoked if I post the \"D\" she's earned. What should I consider?", "A teacher found out that my paper was plagiarized.  What should I do?", "A thorn broke off in the heel of my foot, how should I remove it?", "A woman I love and respect loathes me. How do I get back her love and respect?", "A work friend sarcastically told me no one cared for me, I took this seriously but I'm not sure how to react to it?", "A worker who sits next to me in a cubicle makes fart noises and blames me in front of other workers. He makes a fool out of me for no reason. What should I do?", "A year ago I was a consistent 20 minute 5k runner. I haven't run for 6 months. How & how long do you think it will take me to get back there? (22yo F)", "AFTER PASSING JEE MAIN What TO do TO ENTER IIST?", "AMCAT Preparation : What is the best way to prepare for the AMCAT exam?", "ASUS M4N68 M LE V2 MOTHERBOARD RAM CAPACITY?M planning to upgrade my pc so which is the better option", "Aadhar Card: what should one do with URN No of 12 digits when website asks for 14 Digits?", "Aadhar number how to change?", "Abandoned? Broken hearted granny how can I stop hurting?", "About a year ago my mom found out my dad sleeps with other men , my mom felt completely destroyed, a week later my mom forgave him, but recently I found out my dad keeps sleeping with these men. What should I do?", "About my relationship .want to solve problems?", "Abstact Algebra: why the proofs and problems of group theory are so non-intuitive to me. How should I approach it?", "Academic and Educational Advice: What can I do after completing bcom?", "Accenture location for freshers?", "Accessories that I can buy along with one plus 3?", "According to a guy how a girl can stay safe in face-book? I am specially looking to crack some cheesy tricks used by boys and how to defend those?", "Account opening in Zerodha states 48 hours, I have submitted all documents and it has been 10 days with no luck. Pathetic support, how to escalate?", "Acting: How are film actors able to emote in spite of repeated takes?", "Activate jio4g vice call in my I phone 5s?", "Ad Networks, Ad Exchanges and Ad Services: What is the best way to maximize ad revenue on my website getting about 600k pageviews per month?", "Adam D'Angelo: What is the next step for Quora and how you are planning to build it?", "Adb Transfer Protocol Error?", "Add questions on quora?", "Addiction: How do I curb an addiction to social media?", "Adidas & Reebok have superb shoe designer software from where can I get similar one?", "Adobe After Effects: How can I improve the rendering time in AfterEffects?", "Adobe Illustrator: How can I export the JPG or PNG of the object I selected not contain all objects in the artboard?", "Adobe Photoshop: How do you convert .psd files to .pdf files?", "Adobe Systems (company): How do I begin working with Adlens and what is the pricing model?", "Advertising as a career?", "Advice about this girl?", "Advice for bachelor party on Martha's Vineyard?", "Advice needed for career pathway. Please refer first answer to this question for details. What should I do?", "Advice: how can I stay safe and avoid being conned when meeting a stranger in person to sell my £500 bike to them?", "Adviceable to quit job for 3 month notice period?", "After 2 years being in a relationship my girlfriend says she doesnt want to get physical with me. She says she doesn't like it now. I always think something is wrong and we end up fighting, but she says she loves me. I am confused. What should I do and believe?", "After 2 years living together, my boyfriend broke up 2 months ago. Now, he has come back two weeks ago and asked if we can see each other once a week for a better and more comfortable break up. I accepted and we had sex two times. What should I do if I want to make him come back again?", "After 22 years my husband wants out and I believe he is seeing someone, but I am still very much in love. How do I get over him? Or win him back?", "After 3 months, my girlfriend and I broke up. She says that she loves me but doesn't want to be in a relationship with anyone. What should I do?", "After 8 months of day trading the futures market, I am down $800 from a 5k account, any advice?", "After I confessed my love to my crush. He rejected me and now is ignoring me, why is that?", "After I get an offer, how can I prepare for a software engineering job at Google?", "After I get out of school I feel all tired and don't want to make homework and stuff how can I overcome this?", "After I have read a book, I hardly remember any of the content. Most of the times I can't recall what I read. How can I motivate myself to read?", "After I learn HTML, CSS and Javascript what should I learn?", "After I proposed to my best friend without expectations, she now refuses to talk with me. I want her as friend. How should I convince her?", "After I put my debit card information in on Google adsense, how long does it take for the money to go onto my card?", "After I was dumped, our mutual friends took off on me and one even started dating my ex. What are some ways to overcome my deep loneliness?", "After LinguaLift, how should I continue my foreign language studies?", "After MBBS, I want to open a food court for early money. How should I do it?", "After a 4 year relationship, my girlfriend said she doesn't know whether she loves me or not. I love her, but what should I do?", "After a conversation with a girl how can I tell if she likes me?", "After a group is created in \"WhatsApp\" can I add more people and how is this done?", "After a little workout my heart rate increases drastically and I would go out of breath. What should I do to overcome this?", "After a man falls in love and his heart is later broken, he feels hollow. What can he do to cope?", "After a movie is completed, what is the step by step process of getting it into theatres?", "After a repair, my earphones are now playing mono. Can anyone tell me why?", "After a successful job interview, a potential employer asked me for proof of my compensation history. How do I ask them to respect my privacy?", "After a sunburn, how do you prevent your skin from peeling?", "After a year of my breakup, I have developed this weird sense of fear of not to be seen by him or to see him.Can someone help me figure out why?", "After applying oil to hair, how does one remove oil from hair the next day without using shampoo?", "After bcom can I do mba finance r ms in finance in usa?", "After buying a car how do I get the insurance?", "After completing B.Tech from a reputed institute, how long a break can I take for myself, so that I get a decent job if I come back after 2-3 years?", "After completing BE civil from GTU with average CGPA say 5.5 how can I join indian airforce?", "After completing a BTech from normal local colleges, how can I get placed in top companies like Google, Microsoft, Facebook, etc. with good packages?", "After completing my BSc in geology, I will have a total of 15 years of education. If I pursue an MS from the US it'll be a total of 16 years of education. What should I do if I am really confused?", "After completion of MS course in Engineering management, how do I find job in USA ?", "After dating my boyfriend for about a month, he told me he has a child. Today he said he is visiting that child because she is in our town. I am jealous that he might involve himself romantically with his ex. What can I do?", "After doing a PGP in ACM from NICMAR which job will I be getting and how will be life after that?", "After fever heavy hair fall how to control?", "After filing an AADHAAR number I get a message saying 'no mobile number linked with your aadhar' Why is there no option to add one?", "After finishing urination, when I walk one drop of urine comes out. I don't know why. How do I cure this problem?", "After four years in a relationship I'm losing interest in my boyfriend. I think I don't love him now. What should I do?", "After getting otp how to generate pin for newly debit card of SBI?", "After graduating in CSE 2014 I didn't join any companny due to family business.But now I want to do job.Suggest what are the options I have now?", "After how long can I change my youtube channel name?", "After how long we can start earning from our blog in India? What's the basic rules?", "After how many day of ankle bone fracture can I go back for daily jogging?", "After how many views will I eligible for money on YouTube?", "After knowing how much about programming I should go for Data structure?", "After learning the basics of a programming language, what are the next steps?", "After losing 46 pounds I am obsessed with trying not to gain weight. My parents are worried for me and think that I'm too skinny. How can I maintain my weight without gaining?", "After losing weight, what should by my goal?", "After m.tech in IIT, how to go for PhD in US?", "After making no friends first semester at college, how do I make friends second semester?", "After months of applying remotely to jobs in NYC, I have decided to move without a job in August. What can I do now to set myself up for temporary work as soon as possible after I arrive?", "After multiple unsuccessful interviews, how do I pull myself together to start the application process from scratch again?", "After onsite interviews at Google, I was asked for additional info to start preparing my package for the hiring committee. A few days later, my recruiter backtracked, and asked for an additional interview. What happened?", "After root how can I update my phone from Kit Kat to Lollipop?", "After setting up Outlook (Exchange) on a Mac, I can't see the groups that were previously created in Outlook on the PC. How can I fix this?", "After shaving the bikini area, how do you keep it from getting irritated and itchy?", "After starting my laptop, only the Lenovo screen shows up. What should I do?", "After stopping, my car has trouble accelerating. What could be the cause of this?", "After submitting documents in Accenture, my status is Candidature in process since around a month. When should I expect the offer letter?", "After temporarily disabling my Insta account last night and logging back today, I found out all my 559 pictures are gone. Are they deleted permanently? How do I get them back? \\U0001f614", "After the CFA level 1, what should I do?", "After the ban of ₹500 and ₹1000 notes, what should we do with the existing notes?", "After three surgeries I lost everything, my job, my savings, and I have to start all over again. Though I am young, I still feel depressed. What should I do to get over this?", "After torrent is gone how do I download movies?", "After two RFEs, my H1-B application was denied by USCIS. What options do I have?", "After working for 5 years, I left the company. I will get the Gratuity Amount. How can I reinvest that gratuity amount in the new company?", "After you've posted to Facebook about how great your spouse is, how do you then dump them without looking ridiculous to all your friends and family?", "After you've written the code for a financial trading algorithm (HFT or other), how do you implement it to make trades for you?", "Afterlife: How do I host a seance safely?", "Age barrier for commercial pilot training in usa?", "Aging: I'm turning 40 this year. What should I do to prepare myself for fruitful 50s, 60s, 70s, and beyond?", "Aima busness analytics?", "Algebra: If I'm aiming for a GPA of X, how many 4.0s are needed to offset a single grade of Y?", "All I think about is the millions of ways I could die in an instant. What can I do about this?", "All my apps on Android say I have disabled in-app purchases, how do I resolve this?", "All my college mates have got Cognizant date of joining except me . When may I get?", "All my friends are getting into relationships I feel so lonely inside without a gf how do I over come this?", "All my questions on Quora need improvement. What is the best way to ask a question on Quora?", "All of my photos in the camera folder of my Moto G2 have been deleted accidentally and I didn't even back up any of them. Is there a way to recover them without rooting the device?", "All of those ads about cheques from Google are fake/scams. Is there any easy way to earn money online?", "All the girls I liked have chosen my friends. What am I doing wrong?", "Almost overnight a couple of my upper molar teeth on both sides have started to feel pointy and hurt my tongue when I speak. What should I do?", "Along with 45 minutes of swimming for 3 days a week what other exercises should one do to get rid of belly fat and be in good shape?", "Alternatives to pyxll?", "Am 22 year old guy from India am not settled and see no future, what do I do to earn money ?", "Am 24 years old nd my monthly salary is 1 lakhs but monthly expense is 80ty thousand..how do i save out of this or invest?", "Am 51 and would like tio become pregnant with my boyfriend. Why is it cannot until have seen clinic you have said? Am 51 and pssed menopause. Request", "Am 51 and would like to become pregnant with my boyfriend. Why is it cannot until have seen clinic you have said? Am 51 and passed menopause. Request", "Am How to hack and get the password of a wifi?", "Am I addicted to my job? If so, how can I break it and approach work more rationally?", "Am I an idiot? If so, what are some ways I can improve my intelligence?", "Am I doing it wrong? Is there an alternative way to achieve my goal weight?", "Am I too late if I am starting SAT preparation in grade 11? If not, how can I learn it productively, effectively to gain good scores in the real test?", "Am a 22 year old and have never been in a relationship. In the last two years, I have been rejected by two guys. How should I manage my emotions?", "Am a 3rd year (IT) btech student at IP university Delhi.I know c++, c and a little java (core) . So guide me what should I do to achieve a best job?", "Am a Second officer/JDPO working on DP2 vessel. How can I be on a drill ship or an oil rig?", "Am a undergraduate student (1st year).in cse how can I prepare for gsoc.how should I start to crack it first attemp?", "Am alone and happy, 1-2 hours a day. What should I do in that time? Going out is good but dont have anyone to accompany. I am at Ahmedabad, India.", "Am failing in every subject, am depressed what should I do?", "Am interested in scripting.What is the best and easiest way to learn unix shell scripting? How good is the current job market for this.", "Am not starting big? How can I make $1000 per month online?", "Am travelling with my friends to Thailand between Jan 8 - Jan 15 from Bangalore. Can you tell me how do I plan with visiting Bangkok, Pattaya and Siem Reap? I would like to know about visas and budget as well.", "Amazon Mechanical Turk: I am from India. Is there anyway to get a new mturk account.?", "Amazon internship interview question?", "Amazon process associate?", "Ammonia: I have Ammonium Hydroxide Solution with concentration of about [math]28\\%\\ \\require{mhchem}\\ce{NH3}[/math] in [math]\\ce{H2O}[/math], how can I calculate the concentration of [math]\\ce{NH4+}[/math] in this solution?", "An Investor wants to hire me for 150k per year and have me finish developing my product for 50% licencing rights, what should I watch out for?", "An app to download songs from SoundCloud?", "An eight digit number divisible by 9 is to be formed by using 8 digits out of {0,1,2,3,4,5,6,7,8,9} without replacement. What is the number of ways this can be done?", "An equilateral triangle of side 6cm is inscribed in a circle. How do I find the radius of the circle?", "An ex from two years ago is bad mouthing me and people seem to be avoiding me. What can I do?", "An older man sent my 12 year old son a naked photo of himself. How do I recover the deleted photo and notify Snap Chat about this creep?", "An online friend asked me for my bank account number and my real name to transfer some money to me. What can he/she exactly do with those details (as a scammer)?", "An ordinary Indian, I want to climb mount everest, how can I fullfill my dream?", "An outdated and unmaintained app on the Google Play store is preventing a developer from using that app name. What do I do?", "Analytics tool for flipkart?", "Ancoring script for alumini meet?", "Andrea Navedo: What advice would you give someone who would like to become an actress?", "Android (operating system): How can I solve \"Unfortunately System UI has stopped\" and \"Unfortunately Gallery has stopped\" messages on a Samsung S4 after I upgraded from Android 4.4.2 to 5.0.1?", "Android (operating system): How can I solve the \"there is insufficient space in your device\" problem?", "Android (operating system): How can I upgrade my Mega 2 from version 4.4.4 to Lollipop?", "Android 6:Files on USB OTG drive not detected in directly in apps like Google Music, as previously in Android 5. How to get it working like before?", "Android Application Development: How can I develop and upload an Android app? How can I earn revenue from it?", "Android Application Development: How do I develop an ebook reader Android app?", "Android Application Development: How much would it cost to make an android app like Homejoy?", "Android Applications: How do I replicate the WhatsApp feature \"group name click from action bar\" to get the group member list? How can I add an action bar that is clickable and whose text can be changed to the group name (is it a spinner)?", "Android Devices: How do I set my SD card as default storage on Android Lollipop 5.1?", "Android Devices: When will I get an update of Lollipop for my HTC desire 820?", "Anger Management: How do you deal with anger?", "Ankylosing spondylitis treatment?", "Anonymity: How do I bypass Fortiguard in my School?", "Anxiety is killing me. What should I do?", "Any advice for a first generation college student?", "Any advice for a seventeen year old who just found out she's pregnant?", "Any advice for female solo travellers?", "Any advice on dating a girl 2 years older than me?", "Any advice on tinnitus, I have constant humming in my head?", "Any alternative to Paytm's send money to bank feature using A/c and IFSC where sending money is real time and less costly?", "Any easy way to earn much money?", "Any idea of how I won't be exposed to cold weather at night time when homeless?", "Any ideas for a startup?", "Any ideas for simple digital mini project using logic gates?", "Any ideas for starting up a youtube channel?", "Any ideas of what I should do when I turn 18?", "Any ideas on how to generate a duplicate aadhar card without pincode? I do know my aadhar number and mobile number.", "Any ideas on what to do if I'm bored?", "Any new updates in googlebot because my website pages is not crawling after sitemap Updates on Google webmaster if yes then what is solution for it?", "Any one experienced on marketing live streaming product? Please give me advice about marketing channels for UA. Thx", "Any one knows about any software to create bulk Twitter accounts in short period of time?", "Any pointers on how to do good Spoken Word videos?", "Any proven ways of learning a new language (esp French) efficiently?", "Any recommended tips on figuring out the exact (or closely approximate) date for when a given webpage/post(using its exact URL) went live?", "Any software which can delete data without giving any chance to recover data?", "Any solutions for making wifi signal penetrating a metal wall?", "Any solutions for unable to upgrade access level for viewing to full transaction of SBI net banking?", "Any tips for a young man who wants to successfully develop personally and financially?", "Any website where I can learn cyber security completely free of charge?", "Anybody there? Need guidance for Physics as an optional in CSE mains preparation! How can I really maximise my hold on the subject while keeping in pace with General Studies? - A 2016 aspirant.", "Anybody wants know to know how you can make an extra $1000 a month?", "Anyone can click on the View Source of my webpage and know that I use WordPress. Is there a way I can hide this?", "Anyone have the recipe for Abuelo's salsa?", "Anyone pl; tell me how can I talk to airtel customer care executive?", "Anyway product really helps in hair growth?", "Anyway to change birth date of Gmail account?", "Apache HTTP Server: Proxy reverse configuration?", "Apache Kafka alternatives?", "Apart from a website, what other software do I need to start an online retail shop?", "Apart from calling clients to come and buy our products, what are other strategies we can use while calling clients?", "Apart from uninstalling apps, what is the best way to free up memory space on my Android phone?", "App to prepare for neet medical PG?", "Apple Products and Services: How do you get an iPhone that is stuck in recovery mode to restore?", "Apple mail: is there a way to send customized emails to multiple recipients?", "Application of statics in computer science?", "Apps are automatically installed on my phone. What should I do to get rid of this?", "Apps like Facebook and Messenger keep restarting even after I force to stop them. I've tried Greenify and it also didn't work. I'm on a non rooted phone. How can I force the apps to stop restarting?", "Apps solving problems?", "Apps that need internet are closing unexpectedly. How to solve the issue?", "Apps to hack coc?", "Apt computer hacking?", "Are YouTube tutorials a good way to learn a software?", "Are there any NGOs in Pune where I can teach kids on weekends?", "Are there any alternatives to the phrase \"stay tuned\"?", "Are there any effective cures for eczema?", "Are there any good ways to make side money online a couple hours a day?", "Are there any guides for setting up a website & integrating it into social media, that are as near perfect as can be?", "Are there any ideas to help cure the blind, deaf or hard-of-hearing people?", "Are there any medical coding jobs available that I can do from home? If yes, how can I get it? I stay in India and I am certified.", "Are there any natural method to make water sticky or hard?", "Are there any natural ways to increase Dopamine receptor density?", "Are there any natural ways to reduce melanin production in the body?", "Are there any options for free Minecraft server hosting? If so, what are they?", "Are there any other practical way to reheat pizza if I don't have a microwave oven?", "Are there any practical ways to control anger ? ", "Are there any side effects of protein powder? If yes, how do I overcome them?", "Are there any solutions to track if a PDF has been opened?", "Are there any techniques to get rid of bad thoughts?", "Are there any tips for growing out my beard without having patches?", "Are there any tips for growing taller at 16?", "Are there any tips on the proper way to comment your code?", "Are there any tips one should follow to have a baby boy or a baby girl?", "Are there any tips or tricks for using Quora?", "Are there any tricks in complex numbers?", "Are there any tricks to be a good teacher?", "Are there any tricks to get 3G speed in a 2G data pack?", "Are there any ways I can encourage my body to grow?", "Are there any ways I can get a list of members of a Facebook Public Group, which I am not the admin of?", "Are there any ways to earn investing small amounts in cupidcare.in?", "Are there any ways to increase nose size without surgery?", "Are there any ways to make money through Quora?", "Are there any ways to make money with CPA marketing without a website?", "Are there any ways to reduce nose size without surgery?", "Are there any ways to stop yourself from growing taller?", "Are there any ways to transfer information received from short-term memory to long-term memory immediately?", "Are there any ways to watch movies for free?", "Are there any websites that allow me to search music videos by description?", "Are there easy ways to enhance my WiFi signal?", "Are there good tips on doing push-ups or sit-ups?", "Are there home remedies for Alapacia?", "Are there online store where can I get makeup products to sell as a retailer?", "Are there places, online and offline, where I can find free items that can be sold for a profit on sites like Craigslist and eBay?", "Are there scams on Alibaba? If so, how do I avoid them?", "Are there ways to lock the apps in an iPhone?", "Army technical exam details?", "Arrange marriage scene. Soon I will be meeting the boy's mother for the first time. What are the tips to hit off the meeting and to impress her?", "Articles regarding fashion forecasting?", "Artwork: How to create clip art?", "As I have not completed 10th, besides NIOS, how can I earn my high school diploma in India?", "As I lost my hope in JEE main. My target is VITEEE, Manipal (MU OET) , BITSAT. How do I increase my speed in solving the questions?", "As a 12 year old how do I make myself grow taller naturally?", "As a 13 year old boy I prayed to God to forgive me for my mistakes and sins but nothing happened but I feel like something changed inside of me?", "As a 14 year old with about 2k hrs in CS:GO, what are my chances of going pro?", "As a 15-year-old, what should I do about my social anxiety disorder?", "As a 19-year-old, how should I plan my life to become a successful person?", "As a 21 year old who used to be very insecure, and not achieve nor develop anything. How do I make the most out of life this time?", "As a 22 year old with starting annual package of 18-19 lakhs INR or 30000 USD, how do I go about saving, investments and creating wealth?", "As a 23 year old, how do I get my life together?", "As a 23-year-old girl who has never been in a relationship, why do I need to have a boyfriend?", "As a 31 year-old woman heading towards divorce, how can I begin to rebuild my life again?", "As a B.Arch student, what is the process for applying as a Junior architect in Singapore?", "As a CS undergrad, what should I do besides my regular course and my personal interest in the languages I like to be able to work in Quora?", "As a CSE graduate where I can get internship?", "As a Canadian, how can I buy into Alibaba's IPO?", "As a Catholic, how would you persuade an atheist to convert to Catholicism?", "As a Chinese student, how can I learn English well?", "As a Computer Engineer from India how do I get a job in Japan?", "As a DJ, how can you asses what songs to play for an audience?", "As a Mech Engineering Student (India), how to keep updating knowledge in the field?", "As a PM, when in the process and how often should I be writing specs/PRDs?", "As a PMP certified Project Manager how can I learn different tools and applications relevant to Project Management?", "As a PMP certified project manager how I can learn different tools and applications relevant to project management?", "As a US citizen, how can I assist in the repealing of the 2nd Amendment (gun rights)?", "As a beginner with very limited funds, where should I begin to trade?", "As a beginning épée fencer, how should I take care of my fencing equipment?", "As a black woman how do I attract white men?", "As a chemical engineer (B.Tech 2nd year), how can I get a summer project in any IIT or IISc or ISRO?", "As a college student with an income of $15000/yr currently (I am a commuter student), what strategies can I use to save at least 20% of my income, when I have to spend money on college, loans, and gas?", "As a college student, how can I earn money by myself?", "As a college student, how can I make money online without investing a huge amount of money and time?", "As a college student, what should I do if my team leader (also college student) on a project hates me for seemingly no reason?", "As a computer science student How can I find job opportunity in a compuny like Google?", "As a computer science student, how can I get good internships?", "As a computer sciene student how should I contribute to digital india?", "As a data scientist, how do you explain to a non-technical person what you do for a living?", "As a developer who speaks English, how do I get started developing apps for Mixi, which is in Japanese?", "As a developer, how can I create a Bitcoin wallet?", "As a director of an engineering institute for buy some instruments how we write inviting quotation?", "As a feminine man, how can I embrace my femininity?", "As a finance and economics graduate, how can I get into the venture capital industry?", "As a first time flyer what are some things I should know?", "As a foreigner, what should I do when I forget my social security number (SSN)?", "As a fresher How can I be the penetration tester?", "As a fresher how can I apply for jobs online?", "As a fresher how can I introduce myself for a job interview?", "As a fresher how can apply for the off campus jobs in private companies as a electronics engineer?", "As a fresher in techmahindra , what further course would help me increase my salary package in lesser time?", "As a fresher, how can I include the academic project details in my resume?", "As a fresher, how do I get a job in big data and analytics at Cisco Bangalore?", "As a fresher, how should I learn Big Data Hadoop and How productive will it be?", "As a freshman, how do you promote an app for free?", "As a front-end developer why should I use Linux instead of Windows 10? And how far can I customize it to make the UI better?", "As a gay man, how do I let my straight roommate know that I want him?", "As a girl, how do you finish a toxic benefits relationship with grace?", "As a girl, what would you do if your male boss asks you to wear makeup for work?", "As a graphic design student what should I charge for freelancing if I want to charge per project rather than hourly?", "As a guy with a extra-large penis-- 8 inches and very thick... what can I do to get more sex?", "As a high school student, how can I find easy ways to make some money?", "As a high schooler what can I do on the side to earn money?", "As a huge fan of Game of Thrones, how do I send Emilia Clarke a fan mail? What's her email address?", "As a legal resident in the U.S. who's disappointed by the 2016 election, how can I participate in the process and contribute to the Democratic party?", "As a long-time developer, I'd like to set up a tech recruitment agency based in the UK. How would I find clients?", "As a male INTP, how can I show a female ISTJ that I really like her?", "As a male how do I cope with being oversexed?", "As a male, how can I enjoy myself in shopping malls?", "As a man in my mid-to-late 30s, what do I have to start thinking about regarding my health?", "As a man, how can I tell if a woman finds me attractive?", "As a man, how do I deal with a bossy woman who is either my co-worker or superior to stay out of trouble?", "As a man, what are all the things I should do before conceiving a baby to optimize the health of the baby?", "As a marketer/copywriter, journalist, & creative writer, how can I build my qualifications to be considered for a writing job at Disney Imagineering?", "As a married man how would you respond to the girl who is falling in love with you (she also knows that you are not single)?", "As a mechanical engineering student in a tier 2 college in India, how can one equal the engineer from IITs?", "As a mentally ill guy, I feel like my life doesn't matter because I feel men have no value in society. How do I change my suicidal views in life?", "As a minor, I cannot vote. Yet I see firsthand the education problem in America: our education system is lagging. How would you fix it?", "As a minor, how should I pursue a BDSM-based relationship with an older man?", "As a motorcycle rider, how do you switch to riding a quad without steering in the wrong direction (due to your brain being \"wired\" to counter steer)?", "As a new investor, how can I invest my money in a startup?", "As a new seller in Shenzhen (China) offering a new brand of home projectors in a highly competitive market, how can I maximize my sales?", "As a non-native English speaker, how can I improve my accent?", "As a novice writer, what are some tips to get beyond writer's block?", "As a parent how would you deal with a teenage heroin addict?", "As a parent of a young adult, how would you deal with your child's laziness and help them?", "As a politician, how can I attract young voters?", "As a research scholar I feel too boring at college.What shall I do?", "As a rising junior, what steps can I take to get into a top master's program in statistics?", "As a senior in high school, what are some of the possible routes I can take to become an astronaut?", "As a side business, I am planning to buy a new car and attach it to Uber or Ola. I need guidance and suggestions on what should be the steps to do it?", "As a small business owner who gets paid in cash, how do you get the cash money back in the system (personal bank account) without the IRS disturbing you?", "As a software developer, how can I help fight climate change?", "As a software engineer, how can I get a job that involves travelling and exploring the world like those in TLC, Fox Traveler, etc.?", "As a stay-at-home dad with 2 young boys, how can I stop thinking about my startup ideas I know I won't have time to do anyway?", "As a student hod of administration department what should one do in a college fest?", "As a student how can you be a restorer?", "As a student how can you be restorer?", "As a student how to get ni refund back?", "As a student who is easily stressed by work deadlines/exams, how can I learn to relax and stop myself feeling guilty when I do not work?", "As a teacher, what would you say causes some kids in class to disengage/break rules/not turn in assignments, and what can you do to help them improve?", "As a teen, all the songs that I really like turn out to be old (70s-80s music). How do I fix this problem?", "As a teenager who is to turn 16 soon, do you have any advice for me?", "As a teenager, if you've screwed up a few times in the past, how do you ask your parents for a clean slate, if you're trying to start over?", "As a tester, how can I break a payment gateway?", "As a third year btech student what should I do to start preparing for ias exam?", "As a thirteen year old, what is the best thing I can do for my health?", "As a vegetarian what snacks or food can I give or make for my pet cat?", "As a victim of identity theft fraud, how do I get my money back if I know who did it?", "As a video editor or a film editor, How did you learn video editing from a beginner?", "As a web developer how can I contribute to open source on GitHub?", "As a white person, what can I do to help address racial injustice?", "As a woman, how can I learn how to squirt during an orgasm?", "As a woman, how can I make myself more attractive?", "As a woman, how do you reach orgasm during sex?", "As a woman, if you successfully defended yourself against an attacker and he was on the ground, trying to get up, but you were not sure if he was a threat or not, what would you do?", "As a woman, what are all the things I should do before conceiving a baby to optimize the health of the baby?", "As a woman, what would you do if a man refused to participate in sexual activity with you without a record of you giving him consent?", "As a young woman, how can I shake the feeling that being good-looking is the primary thing that males will acknowledge and praise my existence for?", "As an American expat living in Australia (now a duel citizen) what is the best way to get my elderly American parents residency in Australia?", "As an Indian advertiser, I want to advertise on Twitter. How can we go about it?", "As an Indian citizen in the US, how can I vote in the upcoming Lok Sabha elections from the US?", "As an Indian citizen, what duties can I follow to make my country a better place to live in?", "As an Indian doctor practicing in my own private clinic. How can I earn more? What other sources of income can I use?", "As an Indian guy what one piece of advice you would like to give to an Indian girl?", "As an Indian guy who came to the US for studies and subsequently remained there for work, how do I build a social life from scratch?", "As an Indian guy why do I find it easy to approach white girls, but difficult to get entertained by them?", "As an Indian student how can I make some some decent amount of money online? like 5000 to 10,000", "As an Indian student, how do I convert my college percentage to GPA?", "As an Indian, how can I join a fight against ISIS?", "As an Indian, how do I apply to ETH Zurich and study with a full scholarship?", "As an MFT, how can I increase my income? Other than by seeing more clients.", "As an Uber driver, how do I find riders?", "As an aspiring fiction writer, what should I avoid doing? What can help me keep my story on track?", "As an aspiring writer, how can I become better, and what differentiates a good writer from a mediocre one?", "As an atheist I don't want to live in Turkey anymore. What are my options?", "As an engineer how should I introduced myself?", "As an engineer, how can I get a job as equity research analyst in India?", "As an engineering student who loves science but is coming to hate engineering, what possible cure do I have?", "As an entrepreneur, how can I sell my ideas to an investor?", "As an expat Canadian, how do I get a California driver's license?", "As an intern, how do you go about asking for more work?", "As an international student, how would I apply for financial aid to a private institution such as Cornell?", "As an introvert, I have problems with making friends. Can anyone suggest how I can make friends?", "As an investor how much can I earn in a month by attaching a new car (Wagon R) through Ola (excluding driver's wages)?", "As an undergraduate student, what can I do to start doing research?", "As an unfit, curvy woman, how can I use exercise to gain muscle and become fit and toned?", "As an upcoming web developer, how do I contribute to open source projects so as to gain more knowledge?", "As as a class monitor how will you stop your best friend from bringing camera or mobile phone in the school & what problems you might face?", "As atheist how do you politely respond to religious solicitations?", "As many young people are addicted to their smartphone, taking their phone from them is not realistic. What should parents do? Let it go?", "As much as I love facing challenges, this one is too much for me. I'm more than afraid of speaking in public, so I always take chances to give speeches trying to overcome it. However 20 days after, I'll be speaking and singing on TV! Even now I'm trembling! How can I still behave well?", "As owner of a small biz, how do I address two junior employees who were given a project to complete, but did a terrible job executing the task?", "As part of my role, I am required to send sales emails to prospects. What do I include in the subject line?", "As part of my studies, I am supposed to develop a couple apps and write a report. Can anyone help with some app ideas?", "As per the official key, I got 126 in Tier 1 2015. What do I need to score for an inspector post (examiner and custom)?", "As someone with a strong web/digital design background, how can I possibly translate these skills to television and producing/writing?", "As the white father of two biracial sons, how do I emotionally prepare them to constructively cope with discrimination and racism in its many guises?", "Asana API: How can I download attachments associated with tasks?", "Ashes Cricket 2009 stutters on my new Asus R558UR laptop. What am I doing wrong?", "Ashlee Vance: I have an idea that might take Tesla to the next level. What is the best way to reach Elon Musk in order to discuss?", "Aside from squeeze pages and landing pages, what are the other ways to capture leads quickly?", "Aside from the Wayback Machine, what are other options for getting screenshots of websites from the past?", "Asides going to courts what else can a lawyer do?", "Assuming I have an ISO of windows 7, and I am making a new computer, how can I make a bootable drive to get windows 7 on that computer?", "Assuming my idea has potential to be a success and there is a team which is capable of working on the idea, how do I get funding from angel investors when I just have an idea & no proof of the concept?", "Assuming you want to measure a social phenomena, how do you proceed to create a new measurement? Where do you start?", "Asthma attack no drugs or inhaler for 12 hours what to do?", "Asus: How do I update zenfone 5 to lollipop? My firmware is v 2.22.40.54.", "At around what age should I get a signature at the latest?", "At campus drive of Capgemini, they said results will be out in 3 days but it's been 5 days and no one from our batch got email. What should I do?", "At my college, smartphones are restricted from using the college's WiFi, but we can use it on our laptops (not phones) by using our ID number and password. Some phones are connected to the network, but they can't use WiFi. How can I connect it to the college's WiFi?", "At one point, you come across people who get a lot of things even though they don't deserve it whereas you don't succeed even when working very hard. How would you comfort yourself at that point in life?", "At the moment I am creating a song list to play when gigging. I keep forgetting parts of the arrangements. Is this common? What are some tips?", "At what age can a child start learning Karate and Yoga?", "At what age do we stop getting taller?", "At what age is it toxic to live with your parents? Should I try to move out as soon as I can?", "At what age should I start going to the gym?", "At what age should you start using skincare products?", "At what age will I die if I started smoking at the age of 14?", "At what speed are my teeth moving if I have braces?", "At which banks can I order a cashiers check using cash without having an account?", "Attention to Detail: How can I imbibe this trait in me and make it as a habit?", "Audio: How can I listen to stereo sound through only one of the speakers?", "Auto Repair: How much should it cost to rebuild a 2000 Honda Odyssey transmission?", "Automotive Engineering: How do I do a good system FMEA?", "Avicii, can you give me some tips for start to produce music?", "B.tech electrical and electronic engineer. how dobi get better package?", "BDSM: How does one become a professional dominatrix?", "Back pressure in 100cc engine?", "Backlink analyzing software/site?", "Baking: How do I make cookies that are soft and chewy?", "Baking: What are some substitutes for vegetable oil?", "Bank Accounts: How do I know whether my bank account is linked to my Aadhaar card or not?", "Bankruptcy Law: If I prepaid a supplier for goods which they have not delivered and their bank account has been frozen, how can I get my money back?", "Banks: How do I close an HDFC bank account?", "Bass Guitar: I've just snapped my second A string in the last three gigs, any suggestions why this is and what I can do to prevent it?", "Battle Tactics: How does one set up an effective ambush?", "Been 1 month, Jabong didn't deliver my product yet. Tried contacting them multiple times but they don't even reply to emails. What should I do?", "Beer: Where can I buy Cantillon online?", "Before green signal in traffic, most of vehicles behind me honking like anything. Is there any way to teach them a lesson within a minute?", "Before this week, I was a popular person in my class. Now, people ignore me, and because of that I feel insecure. What went wrong? How do I fix it?", "Beginner Developer confused?", "Being Arrested or Detained by the Police: What's the best way to talk your way out of a speeding ticket?", "Being a 2nd year CS student with average problem solving skill, tell me how can I prepare to get a job in the gaming industry, like in Ubisoft, EA Sports, Bethesda Game Studios, and so on?", "Being a guitarist/keyboardist (self taught intermediate player) I would like to form a band but being a mechanical engineer I have been posted at a remote site. How can I achieve my dream of becoming a musician?", "Being a mechanical engineer yet to complete my degree, what do I have to do to become a design engineer (car designer)?", "Being a mechanical engineering student, how can I get a pre-placement offer (PPO)?", "Being alone saddens me, but being around people makes me tired. What can I do?", "Being an Extreme Mangli, some Tam Bra(Tamil Brahmin) told me to get married to a ‘Cactus Tree’. What should I do?", "Being an Indian how do I start business in African countries like Tanzanian, Kenya, RSA? I belive there is unlimited potential doing business in Africa.", "Being an Indian student, how can I get into the howard university of law?", "Being an ardent fan of Aamir Khan, how do I convince other Khan fans that hes the best?", "Being an automobile engineer what things will help me to make my resume strong?", "Being an engineer (not a student) how can i get an internship (preferably research) from iisc or iit?", "Being an engineer how should I introduce myself?", "Being in my 2nd year of CS engineering, how can I contribute in GitHub?", "Being obsessed over things are hard for me, how come?", "Being too possesive is bad. How do I avoid it?", "Besides advertisement, how does Facebook earn money?", "Besides practicing, what else can I do to improve my coding skills?", "Besides social media, how can I promote content on my website?", "Besides the surgery, is there any way to stop hair loss?", "Besides using transition words, what can I do to make the ideas in my writing flow?", "Best way to learn C language?", "Bf stalks ex on social media even after confrontation. What do I do?", "Bicycle Mechanics & Maintenance: What is the best way to fix a bike?", "Bidding tips for beginners?", "Birlasoft interview questions?", "Biswapati Sarkar: How do you overcome a writer's block?", "Bitcoin in India: Where can I buy bitcoins in India?", "Bleacher report notifications aren't appearing on my phone, I've gone through everything notifications on the phone, still not helping :/?", "Blindloveapp.com will be ready to launch soon. Is there any advise you can give me in order for it to be successful?", "Blogs: How do I design a professional blog?", "Blogs: How do I make $1000/month with a blog or a niche site?", "Blood Types: How can I have ab+ with - antibodies?", "Bluetooth speaker is pairing with PC as keyboad. Anything I can do to make it read as a headphone?", "Bodily discomforts distract me while meditating. What should I do?", "Body Weight: How many pounds can I gain every week?", "Body language: Where should you look while walking?", "Bodybuilding cutting diet?", "Bodybuilding: How to build up back muscles faster?", "Bodybuilding: I am not getting cuts in between my chest and not getting upper pectorals developed. Can you suggest me proper exercises for them?", "Bodybuilding: What is a safe age to do your first Ostarine cycle?", "Book a Tata ace in Bangalore?", "Boolean Logic: how can i prove that x AND y = NOT(NOT(x) OR NOT(y))?", "Boredom is killing me. How do I get rid of it?", "Boredom: What can I do when I'm bored in my house?", "Boredom: What useful things can i do when i am idle and bored?", "Breaking into Hollywood: How do I land a job at a major film studio?", "Bret Taylor: If I wanted to start a tech based company without any coding experience how would I find someone to help me without giving away my idea?", "Bullying: What is the best approach after your child is hit at the playground?", "Business Strategy: I have a website (i.e. www.hostelsincity.com). How can I grow up in the market?", "Business plan is ready and well received by peers. How should I develop the tech part of the business? I am planning to seed my own startup initially", "But how do you learn to fly when they're broken?", "Buying a Home: How should I approach my landlord regarding making an offer to buy the house I rent?", "Buying a golf cart from China as an individual would need you to file a declaration form. Which one do you file? How do you submit it & to whom?", "Buying life insurance at age 60. What should I be careful for?", "Buying my parents home. They want a lump sum and I want minimal or deferred up front costs. Any alternative to mortgage?", "By mistake, I took antibiotics for 17 days, instead of prescribed 5 days. How much harm was done to my body? Please give tips to reduce more harm.", "By way of introduction?", "By what age should I have had my first kiss?", "By what date do I have to apply for ifoa student membership, if I want to sit for September exam diet?", "By what framework may I take the application lock on iphone?", "By what way can I copy asphalt 8 game data from one Android phone to another?", "By which Business, I can be milloniare?", "Byju's tablet coaching for ias?", "C (programming language): How do I master in c stepwise guide?", "C coding in MATLAB plz help?", "C# How to custom tab to make it look like Google Chrome Tab?", "C++ free certificate?", "C++ program to skip only the multiple of x and display all remaining numbersa from n numbers.accept x and n from users.?", "CAN ANY ONE TELL ME WHERE I SHOULD STUDY AVIATION COURSE?", "CAT Preparation: How should I improve quant and reduce inaccuracy in mocks?", "CAT Preparation: What should my CAT strategy be for the last month?", "COMMENT ON GIRL?", "CSS: How do I eliminate this huge unwanted margin between two rows of flex items?", "Ca exam paper checking how it is done?", "Calculus: How do we solve these definite integral problems?", "Call Centers: What is the best way to get campaigns for my call center?", "Camera Sony RX-100 sometimes takes three shots for HDR. How to control this option?", "Campaign email marketing solution?", "Can #StartupIndia help me in funding for a ISP company I want to build? If yes, how?", "Can Anybody help me to find a good palmist/astrologer?", "Can Anyone help me to do coursework in 1 hour?", "Can I Become SEO Expert?", "Can I Chant \"Nam myoho renge kyo\" without asking for something specific, how will that work?", "Can I Create A Cartoon Profile Pic for my YouTube Avatar Easily?", "Can I able to make 5000 rupees into 1 lack rupees in 1 year of period.if it possible how can I able to?", "Can I ask for a share in start up company if I bring in a very big investor who turns it to a big company and how do I go about it?", "Can I be able to comprehend Warcraft 2016 movie if I haven't understood how it all began?", "Can I become a good programmer in 3 years and how ?", "Can I become a professional tennis player if I start at the age of 14? If so, are there any tips you guys can give?", "Can I become more extrovert and if so, how?", "Can I build android app using Python? How can I do it?", "Can I burn another program in 8051 micro-controller's memory if I have burned a program in it once? And how?", "Can I buy a new car from Pune, Maharashtra and get RTO registration of Ahmedabad, Gujarat? If it is possible, what is the procedure and cost details.", "Can I change my branch or college after first year engineering and in which ways?", "Can I change my current email address? How?", "Can I change my iPhone 6 cracked screen by myself without any risk? How?", "Can I change the settings for my Garmin Vivosmart activity tracker from lb to kg & from ft to cm? If so, how?", "Can I create my biography on Wikipedia? If not, then what are the prerequisites?", "Can I do MBBS after doing BDS and where?", "Can I do a PhD in English Literature after doing an MBA? How do I go about it?", "Can I do masters in art after doing bachelor's in architecture? What are my options?", "Can I do masters in industrial design after doing bachelors in materials science and engineering? If not, what should I do?", "Can I do online jobs from home and what are that jobs?", "Can I do programming on my phone?", "Can I do something about my big clitoris?", "Can I donate money to Arthakranti? How?", "Can I earn money by online surveying and how?", "Can I find my samsung guru music 2 mobile which is lost with imei no?", "Can I find tutorial of PSD to HTML conversion?", "Can I get Tableau projects online for wroking from home?", "Can I get a 9-5 job after MBA from Indian B-schools? If not, why can't I have it when COO of Facebook can?", "Can I get a IRCTC tatkal ticket booking in this festive season easily? What tips should I follow to get a confirmed  ticket?", "Can I get a six pack without sticking to a certain diet? If so, how?", "Can I get advice on nontechnical interviews at facebook?", "Can I get an engineering job with a biology major? How do I set myself in college for a high paying job after undergrad?", "Can I get cash back with a credit card? If so, how?", "Can I get messages and photos from wifes whatsup app? I caught her cheating. She won't show me anything.", "Can I get some ideas on Advertising products (presentation)?", "Can I get some ideas on Advertising products?", "Can I get transfer from TCS Hyd to TCS Coimbatore as my would-be husband works over there? How should I proceed further?", "Can I grow my hair an inch within a week? If yes then how? Any tips?", "Can I have some advice before I begin trading in etoro, giving that I am a beginner in trading?", "Can I hide apps in my android phone?", "Can I hire a detective in Delhi to help me for getting my love to me?", "Can I increase my aptitude? If yes, how?", "Can I increase my height after 20 ? How?", "Can I increase my height at the age of 17? How?", "Can I invite people/strangers from other Facebook groups to join my group? If it is not forbidden, how do you usually invite them and what kind of messages do you send to them?", "Can I keep both maiden and husbands surname? What is the procedure?", "Can I know the basics of hacking?", "Can I learn how to play the guitar at 30?", "Can I learn how to play the piano online?", "Can I learn while sleeping? If so, how?", "Can I legally try to make myself immune to all poison and venom? How would I go about it?", "Can I link to youtube videos on my commercial website or in an ebook I sell?", "Can I listen to downloaded GANA songs using my phone's music player? If not, what should I do to make it visible in the music player?", "Can I make 10,000 a month playing online poker? If so, where should I start?", "Can I make 30 million dollars day trading if I start with 500,000? How?", "Can I make Android apps/games with Python? What are some examples?", "Can I make a hard disk into a cloud storage? If yes, how?", "Can I make an Android app with Python?", "Can I make my own Android app?", "Can I make my own app for iPhone?", "Can I make my own programming language?", "Can I make myself shorter if I'm attracted to a tall girl? How can I make myself shorter in height?", "Can I mention Quora in my resume?", "Can I order a new shoe from a cordwainer or cobbler still, if so how and where?", "Can I pick which photos to save on iCloud that I have on my iPhone?", "Can I post photos on Instagram groups? How to do that?", "Can I pre-load a SIM card with apps so you can load them onto your phone? How?", "Can I promote an \"answer\" as there is a way to promote a question?", "Can I publish an Android app without the Play Store?", "Can I pursue chess along with my engineering? What does one require to be a Grandmaster?", "Can I put hydrogen peroxide in my ears? If so, how?", "Can I refuse further steps in an interview process if I feel that the job doesn't match my skills, and how do I go about doing that?", "Can I replace CPU in my old laptop? Or what can I do to make it faster?", "Can I ride my Honda Activa (2014 model) for a 450 km long ride? Bangalore to palakkad if yes what are the tips?", "Can I run to make my legs slimmer? What can I do to slim my legs?", "Can I see the places with the most Facebook check-ins around my current location? If so then how can I see that information?", "Can I sell 2 totally different products under one company name? What are pros and cons?", "Can I setup a DBA for an Multiple Internet Business with a Partnerhip Business Registration setup and How?", "Can I setup an IP camera without DVR? How?", "Can I submit my offer letter and promotion letter and the last three month's salary slips to the MBA colleges as a proof of my work experience? I do not have a relieving certificate or an experience certificate or Form 16 as I left the job without serving the notice period. What should I do?", "Can I teach myself how to play the harmonica?", "Can I teach myself to be a good web developer?", "Can I teach though a curriculum on YouTube for profit? How do I get permission?", "Can I unblock myself in a wifi network when blocked by a network administrator? How?", "Can I use Reliance Jio card on my Redmi 1s? What is the process to buy it?", "Can I use WhatsApp, Tango or Viber to send messages from my computer instead than from my iphone? I need to type in real keyboard", "Can I use a Tata Docomo 3G SIM card in Tata Docomo dongle?", "Can I use my Verizon iPhone as a wifi hotspot? How can I do this?", "Can I use my laptop as a monitor? If so, how?", "Can I use my laptop as a screen for my PS3? If so how?", "Can I use my wifi to get into my hacked laptop? How can I determine what has been compromised? I have changed router passwords?", "Can MBA help me in pursuing my career?", "Can Someone help me find this shirt? I want to get one!", "Can You help me with downloding season 2 of 24 ..the Indian version featuring Anil Kapoor?", "Can a Hindu guy marry a Christian girl? How do I tell her what is in my mind?", "Can a blog appear in the first page of Google search Engine? If Yes, then how can I make my blog appear on 1st page? Can you explain?", "Can a business survive at 10% average gross margins? What are some tips and advice on how to administrate it, etc.?", "Can a commerce student do ethical hacking? And if yes, from where and how should one start?", "Can a start up get loan from INDIAN government for start up venture , if yes what is the procedure?", "Can an average student become a topper in school in the 12th CBSE boards (95+%)? How much time should I study if I'm a PCM student? How can I go behind all the toppers of the class who are really very rude and full of attitude?", "Can any body explain the entire process of study from IGNOU, where do I get study material, should I have to attend class, term exam?", "Can any one explain how \"Book only if confirmed berths allotted\" option works in irctc? Please be as detailed as possible.", "Can any one help in writing c program? Write a program to find second smallest among n numbers", "Can any one help me need some one to talk to?", "Can any one help me understand the schematics to this tremelo?Well apriciated", "Can any one learn technical writing?", "Can any one provide me link to download nuendo 2 with its hack please.", "Can any one say how Interview process for program analyst will be in HTC GLOBAL?", "Can any one suggest a website to buy surgical headlight?", "Can any one tell me how to integrate Django with Angular2?", "Can any one tell me how to solve the aptitude in minimum time?", "Can anybody achieve an orgasm without ejaculation and how?", "Can anybody get creative ideas for writing and composing music? And if so, how?", "Can anybody give me any advice on losing weight safely?", "Can anybody guide me preparing my MBA report for winter training in finance field?", "Can anybody help me by providing me few ebooks for learning PPC?", "Can anybody help me in finding it jobs in banglore?", "Can anybody help me on Networking case study? It is a small case study and anybody from Networking background can do this easily.", "Can anybody tell some of the possible reason of motherboard failure of Nokia Lumia 520 showing message ''Unable to boot''?", "Can anyone get me a referral (teacher or manager) discount on cat coaching at cl , time, mba guru etc? Ps: I would give a share of discount", "Can anyone give a step by step tutorial for free lensing in photography? Especially for the part where you need to break open the lens.", "Can anyone give me a Verilog code to generate PWM for different positions of servo using FPGA?", "Can anyone give me a data flow diagram for car spare part manufacturing company (services done by them)?", "Can anyone give me a description of this picture of a library?", "Can anyone give me a genuine review about the blue mount consultancy Pune?", "Can anyone give me a link to website that can give me coins on pokemon Go without human verififcation?", "Can anyone give me any info about IIRM?", "Can anyone give me suggestion and tips for doing internship in company for 2nd year CSE student?", "Can anyone give me suggestion and tips for internship in company for 2nd year CSE student?", "Can anyone give me the contact details of NKC sir physics teacher as I cannot find on his website. has he stopped selling video packages?", "Can anyone give me the lyrics of 'Endukante Premanta' movie song (kicko gicko) translation in English?", "Can anyone give me tips for gym routine and food intake for gaining weight?", "Can anyone give me tips on how to pass 10th grade with good grades?", "Can anyone guide me for workout?", "Can anyone guide me regarding what kind of questions are asked in NITIE Mumbai for PGDIE intakes?", "Can anyone guide me step by step on how to build a dtg printer?", "Can anyone guide me?", "Can anyone help me and tell me how can I find the house address of a TV actor?", "Can anyone help me as a mentor with my startup idea (implementing)?", "Can anyone help me critique two web analysis reports I created? This is the first time I am doing web analysis and I need an expert web analyst to show me my mistakes and/or need for improvements.", "Can anyone help me find a job?", "Can anyone help me find an old porn starring Kristina Black in which she pees in front of the guy and then they have sex?", "Can anyone help me get started on my calculus project?", "Can anyone help me in MS excel?", "Can anyone help me in listing some of the prominent NGOs in Tripura?", "Can anyone help me in this maths problem?", "Can anyone help me in translating a paragraph from English to German as well as Spanish?", "Can anyone help me looking for a Brazilian dance academy?", "Can anyone help me to convert a parse tree using opennlptoolkit into a SQL query. Detailed steps or link to some article?", "Can anyone help me to crack pte?", "Can anyone help me to solve this quant problem?", "Can anyone help me to start a business in india?", "Can anyone help me to understand BACnet Web Services? Or can anyone help me get in touch with someone who can explain me BACnet Web Services?", "Can anyone help me understand how to sext?", "Can anyone help me where to buy the device called \"Back-to-Back\" converter (AC-DC-AC)?", "Can anyone help me with Black fin 609 assembly language coding (pointing to websites or ur own code will be helpful) on basic operations?", "Can anyone help me with C programming (library catalog)?", "Can anyone help me with my library catalog C program?", "Can anyone help me with reading of my palm?", "Can anyone help translating this Arabic text?", "Can anyone help us to get a medical billing KPO project in Delhi?", "Can anyone help with this math problem?", "Can anyone help with translating this Arabic text?", "Can anyone help with with a math problem?", "Can anyone learn how to code?", "Can anyone learn how to cook? Why or why not?", "Can anyone learn how to sing well?", "Can anyone motivate me somehow?", "Can anyone of you tell some multiplication tricks?", "Can anyone offer advice to a guy needing help helping someone with fatherless daughter syndrome?", "Can anyone provide code for first visit pop-up notification box?", "Can anyone provide lyrics to the following song, I’m not native speaker so I need your help?", "Can anyone provide me a study plan for JEE 2017 from now on?", "Can anyone provide me a study plan for my drop year for JEE 2017 preparation?", "Can anyone provide me all the websites which I can refer to for government job notifications, I m an engineering graduate in Mechanical?", "Can anyone provide me an authentic recipe for mughlai goat qorma or refer to the right website?", "Can anyone provide me information about SAP?", "Can anyone provide me source code in magento for SMS Gateway Integration?", "Can anyone read my palm and tell me about my career , marriage or something that can help in future?", "Can anyone see a list of my secondary blogs I write on Tumblr?", "Can anyone send me the link to solution manual of Financial Accounting a managerial perspective by Narayanaswamy?", "Can anyone share me about an embarrassing situation due to your shyness?", "Can anyone share the Google Search query PDF link?", "Can anyone solve and explain this to me?", "Can anyone solve the equation [math]x^{4}=x+1[/math]?", "Can anyone teach me Spanish?", "Can anyone teach me basic Spanish?", "Can anyone teach me some words in Japanese and there meanings?", "Can anyone tell or show me how to play the Dark, Dark, Dark song \"Daydreaming\" on piano? I'm dying to learn it.", "Can anyone tell the program for sequence 4,6,12,18,30,42,60,72---n?", "Can anyone tell what is the best way to learn a new language?", "Can anyone tell where to get magic mushrooms in Delhi/Noida?", "Can anyone translate please ?", "Can anyone translate this Korean into English?", "Can anyone translate this for me?", "Can anyone translate this?", "Can anyone who is currently a volunteer with any of the NGO in Mumbai tell me where can I volunteer as a teacher in Mumbai on weekends?", "Can anyone with a successful business give me some tips they figure is must-knows?", "Can anyone write me a tanka about water?", "Can clients pay me directly via Skrill without the need of freelancing sites?", "Can learning how to code make you smarter?", "Can not find a job?", "Can one be madly in love with one person and at the same time have an intense crush on another? How does one handle this situation?", "Can one beat addiction without professional help? How?", "Can one download \"Cracking the Coding Interview\" PDF? If so, where?", "Can one prepare for UPSC prelims in 15 days? If so, how?", "Can raising a dog teach me how to raise a child?", "Can some one give me tips on learning piano?", "Can some one guide me to score good marks in PTE exam?", "Can some one share their vimrc settings to help with PEP8 standards?", "Can somebody explain to me how to do with steps this five little problems?", "Can somebody explain to me how to do with steps this little problem?", "Can somebody help me to solve this problems?", "Can somebody help me with this math problem? ", "Can somebody just tell me what to eat hour by hour to lose weight? I want to lose 30 pounds.", "Can somebody share with me about his/her story towards how they quit porn & masturbation addiction?", "Can somebody suggest me which silencer do I buy for my Thunderbird 350?", "Can somebody tell me how I can get someone's Snapchat password? I want a real website no human verification no survey!", "Can someone deny me (Hindu) entry to a temple in India if I wear cross? What can I do in such a situation?", "Can someone find my IP address from a mobile chat?", "Can someone find your number through remind 101? If so, how?", "Can someone give a review of Free Code Camp?", "Can someone give me a rundown of how the internet and the world wide web work?", "Can someone give me an idea about CAT exam?", "Can someone give me challenges to stop caring what people think?", "Can someone give me proper piano notes for Laag Ja gale. the one on net is not proper?", "Can someone give me some advice on how to cope with what is called my life?", "Can someone give me some tips on writing a newspaper article?", "Can someone give me the datasheet for TEG?", "Can someone give me the formula for a cheap, high winrate Yogg-Saron Druid deck?", "Can someone guide me as to how can I prepare for a MBA marketing interview as my placements start in 2 months?", "Can someone guide me as to how to start and clear CMA(USA)?", "Can someone hack my smart phone using WhatsApp?", "Can someone hack your iPhone and how?", "Can someone help me find a song?", "Can someone help me find out my sexual orientation?", "Can someone help me find this shirt? I want to buy it!", "Can someone help me grow my Minecraft server community? If not, at least tell me if it's any good. Would appreciate it.", "Can someone help me hack my gmail account?", "Can someone help me in coffee shop project?", "Can someone help me in solving this integral?", "Can someone help me learn how to use Paytm?", "Can someone help me like how could I get my college university to declare result, its been 3 months?", "Can someone help me plan a two day trip to coorg?", "Can someone help me solve this integral?", "Can someone help me square my workout regmine with using the targeted ketogenic diet?", "Can someone help me translate this to Slovak? I’ll send it to my best friend", "Can someone help me with depression?", "Can someone help me with details about Ernst & Young's global operations in Chennai?", "Can someone help me with some acro dance info?", "Can someone help me with steps of Canadian express entry process for PR from India?", "Can someone help me with this interview question of Uber?", "Can someone help me with this math question?", "Can someone make $1m in a week? How?", "Can someone master all of the functionalities of Microsoft Dynamics 365? How can you do that and what's the scope?", "Can someone on the computer see when the last time I was on hangouts?", "Can someone plz give the Detailed procedure of appearing for CBSE board exams?", "Can someone provide me with a short write up on an experience as a school headboy?", "Can someone refer me for the post of associate software engineer in Accenture?", "Can someone retrieve my photos if they have my phone's MAC address?", "Can someone send me message in Instagram after they blocked me?", "Can someone share their interview experience with me?", "Can someone show me how I can send someone on Quora a private message?", "Can someone show me how to balance this chemical equation?", "Can someone teach me how to code a app?", "Can someone tell me from where can I download WordPress for website making?", "Can someone tell me why Quora collapsed my answer and what can I do to get it uncollapsed?", "Can someone translate Latin to English for me?", "Can someone translate a picture from Arabic to English for me?", "Can someone translate this Japanese comment section to English?", "Can someone translate this Kannada text to English/Hindi?", "Can someone translate this image to English?", "Can someone translate this in english?", "Can someone translate this picture to English?", "Can someone translate this to English from Korean?", "Can someone translate this to English?", "Can someone with a good business idea in a country like Peru get seed capital / funding from american VCs, even if the project is aimed for the Latin markets? How hard is it? What would I need to do?", "Can someone, suggest me a good tutorial for making wallpaper app for Android using Flickr API?", "Can users follow my secondary blogs? Where can I view my followers?", "Can we begin a movement through Quora where we can discuss on how to protect our environment and thus bring a reform in the government policy?", "Can we do sentiment analysis on Facebook data like we do on Twitter using API in Python? How? If not, is there any other way to do it?", "Can we really earn money online? How?", "Can we stop global warming? What are some ways and ideas to stop it?", "Can we write \"attrib -s -r -h *.* /s /b /l\" command in admin command prompt for c:/ ? What happens by writing this command?", "Can we write blogs on Quora? If yes, then How?", "Can you add topics to a question? How?", "Can you advice me some Irc channels where I can find and share support for php, html, css, javascript, ruby on rails development? Or also if you know a different platform instead Irc, let me know, but it should be in real time (as a chat).", "Can you cook polish sausage in the oven? How?", "Can you do a 3-way Skype call? If so, how?", "Can you explain me what is the meaning of a gilt fund. What is the best way to use a gilt fund and how long does one ideally stay invested in these?", "Can you fix a broken iPad screen? If so, how?", "Can you get 4G on an iPhone 4? How?", "Can you get my what's app account back on my phone?", "Can you give me a way to make $1 million in a single day?", "Can you give me an idea about binary options scams?", "Can you give me feedback for my YouTube videos?", "Can you give me feedback on my YouTube Channel?", "Can you give me feedback on my YouTube channel?", "Can you give me goggle tips?", "Can you give me more useful information about Volvo Repairs Sunshine Coast?"]