[" Politics of Tamil Nadu: How did 'Gopalasamy' become 'Vaiko'?", " The Mortal Instruments (book series): What is the ship name for Mark Blackthorn and Kieran?", " What is this and what does it mean?", " what are the examples of  radio frequency identification systems used in tracking ?", "\" My recovery must come first so that everything I love in life does not have to come last \" What is the meaning of this quote?", "\"32-bit operating system x64-based processor Windows 8.1\" What does this mean?", "\"A man can own several wives, but a woman should be dedicated to only one man\". What were the reasons behind this mentality, in Indian mythology?", "\"Believers:\" What makes you think your religion is the right one?", "\"Better a thousandfold abuse of free speech than denial of free speech.\" What does this quote mean?", "\"Bibliography\" is the list of books referred while making a paper. What is the word one can use to refer to the websites referred to make the paper?", "\"CAS PRES CHQ\" what does this SBI statement message mean?", "\"Cauvery is Ours\". What does Ragini means? Does any particular state take ownership of a national resource?", "\"Decision making requires ability to handle information carefully \"Explain, How can you identify information needs?", "\"Dhol Ganwar Shudra Pashu Nari Sakal Taadana Ke Adhikari\"  What does Tulsidas precisely mean by this quote?", "\"Each value xi is paired with fi indicating that approximately 100 fi % of data are < xi\".Can someone explain this line?", "\"Electrons feel the force exerted by a magnetic field\". Is this statement correct and why?", "\"Evolution is based on scientific evidence, but slavery was too\". What can I argue against that?", "\"From Raveena Tandon to Nawaz Sharif\" was written on a bomb used to attack Pakistan during the Kargil War. What is the connection between these two persons - the PM of Pakistan and an Indian actress?", "\"Hearty in your approbation and be lavish in your praise.\" What are some real-world examples of this saying?", "\"How does yoga result in weight loss? I mean, we sweat so little?\"", "\"How people treat u is their karma, how u react is urs\" what if their treatment hurts/disturbs me? Is it not my karma if I'm suffering bcos of it?", "\"I am a lover of women\"…What exactly does this statement mean?", "\"I am sorry\" vs \"excuse me\": When should each be used?", "\"I'm not gay but my boyfriend is.\" What does this phrase mean?", "\"If people treat you like an option, leave them like a choice\" and \"If you feel that you are avoided by someone, never disturb them again.\" What is a brief explanation of both quotes? What is the difference between them?", "\"If you are good at something, never do it for free.\" What is your opinion on the Joker's quotation from The Dark Knight?", "\"It is very easy to defeat someone, but too hard to win some one\". What does the previous sentence mean?", "\"Kiss me slowly\" song by Parachute comes in which genre? And can you explain that genre?", "\"Marriage is an institution.\" What does this mean?", "\"Maybe life isn't about avoiding the bruises. Maybe it's about collecting the scars to prove we showed up for it.\" What is the meaning of this quote?", "\"No happiness without order, no order without authority\" What's your opinion on that quote?", "\"One puzzle along with my name,\"  the above is the puzzle asked to me in an interview. What should I have replied to this puzzle?", "\"Rapid Thought\" grammatically correct? What does it mean?", "\"Soft commitments for current round from current investors\".What does it mean?", "\"Surprisingly though\" or \"surprisingly, though\"?", "\"Switches are more intelligent than Hub\".Explain.?", "\"The Apple I was a…circuit board containing over 60 chips\". How many integrated circuits are in the basic motherboard?", "\"The Force is strong in my family, my father had it, I have it, my sister has it. You have that power too.\" Who is Luke talking to, if not Rey?", "\"The Man with a Scar\" October 1925 International Magazine Summary for assignment by w. Somerset Maugham?", "\"The more things change, the more they stay the same \". I am not exactly clear what this phrase mean. Can anyone help me?", "\"There's no fool like an old fool.\" What does it mean?", "\"Until the lion learns how to write every story will glorify the hunter\" what does the above mentioned saying/quote mean?", "\"War is nothing but the continuation of diplomatic policy by other means.\" To what extent do you agree with this?", "\"We make peace with our enemies, not our friends.\"- Tyrion Lannister. Can anyone explain me what is meant by that statement?", "\"What are statements that 2-year-olds make?\"", "\"What do you consider as fun?\"", "\"What goes around comes around\", How does it happen in your real life?", "\"What has passed is past\" vs \"What passed is past\", which one is correct?", "\"What is the scientific definition of reality?\"", "\"Why Engineers don't have logo like that of Doctor, C.A., Advocate?\"", "\"Why do You choose our bank?\" How do I answer this question?", "\"Why ravindra babu ravula left cisco?\"", "\"You can tell the greatness of a man by what makes him angry \" - ABRAHAM LINCOLN. What makes you angry? How do you judge people by things that make them angry?", "\"was this the only time in history that...\" or \"is this the only time in history that...\"? Which is correct grammar?", "\"what is contract law?\"", "#What are the major differences between Chinese and western cultures?", "'Compulsory CBSE class X board exams from 2017-18'. What do you think of this decision made by the government?", "'He is one of the boys, who love/loves to pay respect to elders' what is the right thing?", "'The Shawshank Redemption' and 'The Godfather' both have the same rating by IMDb so why is 'The Shawshank Redemption' placed at the first position?", "'Today's children are fashion victims'. If I am speaking about this topic, what are the points that I can add to my speech for a debate competition?", "(Combat tactics) How would a Spanish invasion of Gibraltar play out?", "(Embassy attacks in the Middle East--Sept. 2012): What historical diplomatic events might be analogous to the U.S. Embassy statement in Cairo?", "(If) IP is an unique address of a host, then why is MAC address required?", "(Names) Nicknames for Ferdinand?", "(Spoiler) What happened to Haradrim and the Southrons and Easterlings after the Ring was destroyed and the battle ended?", "(UK) How do you calculate the value of a lease extension if the property is being run as a charity?", "(X-2) ^ (2x-8) =9.to calculate x?", "(a) There are many different people in Europe. (b) There are many different peoples in Europe. Which one is grammatically correct?", ") The biggest possible circle is inscribed in rectangle of length 16 cm and breadth 6 cm. Then the area of circle is?", ",What type of acts justify trying someone as a war criminal?", "-M-A-I- WHAT IS THE PUZZLE?", ". Are there any other indicators which can be used instead of phenolphthalein, if yes name the indicator? For the titration.", ". If the statement ‘‘”LINUX is only the karnel, and is not the full system that you use’’ holds true .justifythis statement?", ". What will happen if oil is mixed with boiler feed water?", ".A cube is colored on the opposite faces blue, black and yellow. It is then cut into 36 cubes.Out of which 32 were small cubes and 4 where big cubes?", ".A sum of Rs. 8.25 is made up of 100 coins which are either 10 paise or 5 paise. How many are there of 10 paise?", ".There is 1kg and 792g of barrel oil in 2 containers, what will be the quantity if we divide it in 4 boxes:?", ".o (. (9yease km?", "0 ≤ I <} 2 1} what does this means?", "05 Tacoma 4 cylinder has slight vibration while stopped at a light, why?", "1 TB= how many GB?", "1 ampere is equal to how much charge?", "1 crore to usd?", "1 light year is equal to how many years of the Earth?", "1 quadra billion is equal to how much billion?", "1+1+1+1+1+1+1+1+1+1+1+1 x 0+1=?", "1+1= ? . Please provide a reason along with your answer.", "1, 10, 27, 64, 66, What is the next number in the sequence?", "1,1,2,2,2,2,3,3,3,3,3,3… and so on. what is sum of the series of first 1000 term?", "1. Aside from being 100 years old, what is \"magical\" about Eileen Kramer?", "1. How many binary strings of length 9 are there such that there are three 1’s and 6 0’s?", "1. On a scale of 1 to 10, how happy are you at work?", "1. When an accident or disaster occurs, many people will panic or just stand there looking. Why do they react that way?", "1. Why do we need facts?", "10 point difference between manager, capitalist andentreprenuerer?", "1000 and 500 notes have been banned in Indian. What will be the short and long term impact of this?", "1000 distance between point A and B, 2 person at opposite Side speeds 60kmph 40kmph respectively when they meet 20th time what is distance from B?", "10:10, 11:11, and 12:12 are the times I've been checking my watch for the past 3 month, not intentionally of course, but when I just feel like checking the time it just happens to be at one these positions on my clock. What's the reason behind this?", "11, 8, 13, 12, 15, 16, what is next number?", "111", "12,12,18,45,180,1170? Complete the series with explanation?", "121,1221,1432. What is next number in this series?", "12:27,31:66,45:99,72:? .what comes in the place of question mark?", "14 countries voted against Israeli settlements when the UN conferenced. Which countries voted to condemn Israel for their settlements?", "15th aug speech in hindi?", "16,06,68,88,x,98. What is x?", "1996Use the numerals 1, 9, 9 and 6 exactly in that order to make the following numbers: 28, 32, 35, 38, 72, 73, 76, 77, 100 and 1000?", "19^77/7 19^120/7 19^200/7 what will be the remainders of these?", "1=5,2=25,3=125,4=625,5=? What is the answer?", "1GB is equal to how many MB? Google is showing 1000 MB but my computer storage is showing the story of 1024 MB.", "1cc. of 0.1N HCl is added to 999 cc. Solution of NaCl. What will be the pH of the resulting solution?", "2 oranges, 3 bananas and 4 apples cost Rs.15. 3 oranges 2 bananas 1 apple costs Rs10. What is the cost of 3 oranges, 3 bananas and 3 apples?", "2 wolves and a lamb vote on what's for dinner argument (tyrannic majority) is often made for electoral college. But is it truly democratic?", "2 years back I used to feel so much about everything but now I don't get excited about anything, I don't feel pleasures of life. What is wrong?", "2+4+6+...+582= What is the sum?", "2. How and why did Arabs become the worlds leading merchants between 600 and 300 C.E.?", "2. If the Universe was born at the Big Bang, what existed before then?", "2. What are the elements in your life that make it \"complicated\"?", "2.7 million dogs and cats are killed in America alone, what happened to their corpses? Is it morally wrong to use their skin or eat their meat, or simply wasteful?", "20% of a 6-litre solution and 60% of 4-litre solution are mixed. What percentage of the mixture is of the solution?", "2012 Democratic Convention: What was the song played when Obama walked out on stage?", "2012 Democratic Convention: Who wrote Michelle Obama's speech?", "2012 Summer Olympics in London: How much endorsement money did World Champ Jordyn Wieber lose by failing to qualify for the All-Around Gymnastics title?", "2012 Summer Olympics in London: Opening Ceremony: What was the significance of the blue lit section where people wearing white flapping wings cycled round in opposite directions?", "2012 Summer Olympics in London: What happened to Stephanie Rice in the 400m individual medley?", "2012 Summer Olympics in London: Why do Olympians on Team USA have to pay taxes on the medals they win for the country?", "2012 Summer Olympics in London: Why is the team of United Kingdom being referred as Great Britain?", "2013 Israel Elections: How many laws have been written and passed during the 18th Israeli Parliament (Knesset the 18th)?", "2013 Israel Elections: What is Yair Lapid's Yesh Atid plan for changing the Israeli parliamentary system trying to fix?", "2013 Israel Elections: What is Yair Lapid's Yesh Atid plan for changing the Israeli parliamentary system?", "2014 NFL Playoffs: In his 58-yard run against the Seahawks, did Colin Kaepernick run out of gas? Why didn't he score?", "2014–15 NBA Season: How did Steph Curry get a black eye?", "24 points divide a circle into 24 equal arcs. Join every 2 points by a line. How many triangles formed by those lines are right-angled triangles?", "25% less than 300 is what % more than 200?", "28,34,18,24,26,30,35,33,38,40,31,37 find the median, mod and mean of the following data.?", "28-28=24-14=22-20=answer the next sequence by logic?", "2n+4-2n+2=3 then n is equal to?", "3 block with mas 6kg,9kg,10kg are connected as shown.The coefficient of friction between the table & 10kg block is 0.20.find; acceleration of system?", "3 branches of gov?", "3 digit no unit digit, ten digit and hundred digit ratio 3:5:7 if the diff of original number and obtained by reversing the digit is 396 find the no?", "3 digit no unit digit, ten digit and hundred digit their ratio 3:5:7 if the difference of original number and ŕeversing the digit is 396 find the no?", "3 reasons to choose our PowerPoint Design services, Why?", "3) When sampling in soil environments, what size and how many samples would be taken per site in general? What are the dangers in storing the samples improperly?", "3. Who decides who will manage the company and how?", "3. why did the joint venture collapsed in 1989? Infosys", "3000 JP mile means how much rupess in indin currency?", "4 3 2 1 formation advantage and disadvantages?", "4 of my friends can't ask a Quora question! The \"Ask Question\" at the top right of the page does not appear with their accounts! Why? Will this be fixed?", "4 point charges on a square net electric produced?", "4 qualities of alluminium?", "460 is the area code to where?", "5 cc is equal to how many ml?", "5 problems faced by common people?", "5, 9, 1, 7, 3 are written in a special order. What is it?", "5. Under what circumstances can one expect radiation heat transfer to be significant?", "50 kg of sand is equal to how many cubic meter?", "50 vs 85mm prime lens, why choose one over the other?", "6,000,000,000 Clone troopers and 7,000,000,000 Stormtroopers brutally battle it out on Hoth, who wins?", "6-5=2? What is that?", "6. Why does the speaker want to become a tree?", "610mhz626mhz658mhz706mhz…whats the next mhz frequency? Based on satellite cable receiver", "63 democratic countries have elected a female leader in the past 50 years, why the USA didn’t have one? (trustlessness or inequality)", "6786156027 where is the lsst onown loc a tion?", "68 is 1/4 of what number?", "68.44% of product passes the process spec.To pass, the product must be close to average. How many standard deviations away does 68.44% represent?", "7, 4, 6, 3, 4.5, 1.5, 2.25. What is the next number?", "7. How would you define success in social media in terms of metrics", "7cpc.india.gov.in: What is the 7th pay commission hike in salary of PSU employees?", "9,10,65,26 ,--,50 what would be the missing number in the sequence?", "9,18,15,45,41,164 what will next?", "9.Sulfur dioxide and bromine and water react to form hydrogen bromide and sulfuric acid (H2SO4) . SO2+Br2+2H2O→HBr+2H2SO4 S2O+2Br+2H2O→2HBr+H2SO4 SO2+Br2+H2O→HBr+2H2SO4 SO2+Br2+2H2O→2HBr+H2SO4?", "90% of girls we know have boyfriend and 90% boys does not have a girl friend. How this is possible?", "94 Honda Accord LX loses power when driving shuts down then restarts?", "94% of white liberals believe in white genocide. What are your thoughts?", ": Main file specified in package.json, but not found: index.js. WARNING: Looking for common main file names: index.js, app.js, server.js, main.js.?", "?", "????", "@Lesbians: How exactly do you have sex?", "A \"Friends\" episode was dedicated to Pearl Harmon. Who is that?", "A 2 kg ball is dropped from 25 m up. How fast is it going 5 meter above the ground given that there is no air friction?", "A 2H inductor is in series with a 11μF capacitor and a 390Ω resistor, at what freq will the circuit resonate? Also what is the Q factor & bandwidth?", "A 4-digit number multiplied by 4 gives same number in reverse order. What is the four digit number and how do I prove it?", "A Beautiful Mind (2001 movie): What is meant by Platonic Activities?", "A Muslim woman and a non Muslim man like each other. What options do they have?", "A Pizza has radius \"z\" & thickness \"a\". What is its volume?", "A Secure and Dynamic Multi Keyword Ranked Search Scheme Over Encrypted Cloud Data?", "A Song of Ice and Fire (book series): What is the \"Great Northern Conspiracy\"?", "A Song of Ice and Fire (book series): Why was Jon Snow betrayed?", "A T90 and a Challenger 2 simultaneously spot each other on a grassy plain at a distance of one mile in a time of conflict. Which tank wins?", "A World of difference Between Handcrafted and Handmade Silver Jewellery?", "A babysitter came over to babysit 10 children. She decided to give them a snack. In a jar there are 10 cookies. She wants to give each child a cookie, but still keep one in the jar. How will she do it without breaking any cookie (i.e. each child has to get a whole cookie)?", "A bag contains 4 balls. Two balls are drawn at random and are found to be white. What is the probability that all balls are white?", "A bag contains 5 white and 3 black balls, and two balls are drawn at random. What is the probability that both are of the same color?", "A bag contains one ball, either red or blue. We put a red ball in the bag and shake it well. Then we draw a ball out of the bag and it turns out to be red. We now draw the other ball out of the bag as well. What is the chance that it is blue?", "A bag contains12 different chocolates, 4 different mints, 6 different toffees.3 sweets are chosen.how many ways are there of chosing all not chocolates?", "A ball dropped from the height of 50m is entered 5cm in sand .find the force on ball by sand?", "A ball dropped from the roof of a building takes 4.0s to reach the street. How many feet high is the building?", "A ball is rolling up a ramp when a force is applied on it. After rolling for a distance, it comes to a stop. What causes the ball to stop?", "A ball is thrown from the top of the building of a height of 80m. At the same instant, another ball is thrown upwards with a speed of 50m/s from the bottom of the building. At what time will both meet?", "A ball is thrown horizontally from a cliff at a speed of 7.0 m/s. What is its speed 1.1s later?", "A ball is thrown vertically upward with an initial speed of 15 m/s from 80 m above the ground. Assume free fall conditions. (a) What is the max height? (b) Determine the magnitude of the velocity at 40 m above ground. (c) At what speed does the ball strike the ground?", "A ball of weight W is thrown upwards with a vel v. If air exerts an av. resisting force F, the velocity by whch the ball returns to the thrower is?", "A ball projected vertically upwards from 'A', the top of a tower, reache the ground in 't 1..(Full question is in the description below)?", "A ball thrown horizontally from the top of a building 55m high strikes the ground at a point 35m from the building. What is the (a) time to reach the ground, (b) the initial speed of the ball, and (c) the velocity by which the ball will strike the ground?", "A ball travels at 5.5 m/s in the ceiling of a building. When it falls to the ground, it is 15m away from the base. What is the height of the building?", "A balloon in space is inflated with hydrogen indefinitely without popping, how big in diameter would it be when the surface gravity was one G?", "A basket contains 10 apples and 20 oranges out of which 3 apples and 5 oranges are defective. If we choose two fruits at random, what is the probability that either both are oranges or both are non defective?", "A basket contains 3 blue, 5 black and 3 red balls. If 3 balls are drawn at random what is the probability that all are black?", "A bat and ball cost $1.10. The bat costs one dollar more than the ball. How much does the ball cost?", "A block is projected along the rough horizontal road with a speed of 10m/s. If the coefficient of friction is 0.10, how far will the body travel before coming to rest?", "A boat floating in the middle of a pond is loaded with rocks. A man in the boat throws the rocks overboard. What will happen to the water level of the pond?", "A body is acted upon by constant force. what is the nature of the displacement-time graph?", "A body is projected at angle of 30° to the horizontal with a speed of 30m/s. What will be the angle with the horizontal after 1.5 seconds?", "A body moves 6m North, 8m East and 10m vertically upwards. What would be its resultant displacement from the initial position?", "A body moving with velocity v=2t^2+5t. if initial displacement is taken as 5 cm then find the value of its displacement and acceleration after 5sec?", "A bowler takes three wickets in three different overs and it was a hat trick. How did this happen?", "A box contains 2 red, 3 black and 4 blue balls. 3 balls are randomly drawn from the box. What is the probability that the balls are of different colors?", "A bullet twists at the rate of 1 twist per 12 inches. How many times does it revolve while it travels 20 feet?", "A cache miss takes 50 ns to acccess memory and a cache hits take 5 ns. It's seen that 80% are cache hits. What is the average memory access time?", "A capital invested at a compound interest rate C,C1,C2,C3,C4 the future values of capital in 5years.knowing that C+C1=125700,C3+C4=180714Calculate FV?", "A car is moving from the equator to a pole and then back to the equator. Where will it do its maximum work?", "A car travels 200km in 2 hours and 24 minutes. What is the average speed that the car is traveling?", "A car travels from A to B at the rate of 40 miles per hour, and then returns from B to A at the rate of 60 miles per hour. Is the average rate for the round trip more or less than 50 miles per hour? Why?", "A case against open instruction sets?", "A circle is circumscribed around a square.The area of one of the four shaded portions is equal to 4/7. What is the radius of the circle?", "A clinic charges more than the MRP at their pharmacy. What action can be taken against them?", "A clock is set right at 10 AM. A clock gains 10 minutes in 24 hours. What will be the true time when the clock indicates 3 PM the following day?", "A coin that comes up heads with probability p is continually flipped until the pattern T T H appears. Let X denote the number of flips needed until the pattern is observed.  What is the expected value of X  i.e. E [X]?", "A committee of 4 is chosen from 7 men and 6 women. How many different ways can it be chosen if it must include 2 of each gender?", "A company has to follow depreciation rates as per income tax and as per companies act. Why?", "A compound bourdon gauge is capable of measuring of what?", "A compound has the molecular formula XeOn where n is the number of oxygen atoms. What is the equivalent of n when the dipole moment of the compound is minimum?", "A compound has the molecular formula XeOn where n is the number of oxygen atoms. What is the equivalent of n when the dipole moment of the compound is minimum? Options are zero, 1 or 3.", "A computer program needs certain amount of RAM to run. How is that decided? Does it largely depend on size?", "A cone is filled up to height h/2 above the base.h is the height of cone and base radius is r.To what height does water rise if the cone is inverted?", "A convex lens with a focal length of 20 cm is placed in front of a convex mirror with a focal length of 7.5 cm. A luminous object is placed in front of the convex lens at a distance of 40 cm from it. What is the distance between the mirror and the lens to get the object's erect image coincident with the object?", "A cooler hold 8.5 liters of water. how many gallons does it hold?", "A couple (say A and B) decided to commit suicide after a rough life. They decided to jump off a building. When they got to the top, they both counted to three. A jumped, but B stayed. B watched A drop for about 8 seconds and then saw a parachute open. Who betrayed whom?", "A couple who has 5 sons went for a picnic. Each son has 7 sisters. Each sister has 3 babies. In total, how many people went for the picnic?", "A couple who loved each other truly had to get married to someone else due to family pressure. How do they feel about it now?", "A crate is slid across a floor. The mass of the crate is 200kg and the coefficient of static friction is 0.30. How much force is needed to keep the crate moving to the east with a constant velocity of 4m/s?", "A crate is slid across a floor. The mass of the crate is 200kg and the coefficient of static friction is 0.30. How much force is needed to keep the crate moving to the west with a constant velocity of 7m/s?", "A crew team rows a boat at a rate of 20 km/h in still water. In practice on a river, the team rows for 30 minutes up the river and then for 30 minutes down the river. The speed of the river current is 1.5 km/h. How much farther did they travel in the 2nd 30 minutes?", "A cricket team comes for batting and they get all out in the first 9 balls without even attempting for runs. Which batsman will remain not out?", "A current flows in a conductor from west to east. What is the direction of the magnetic field at a point below the conductor?", "A cyclist is riding a circular path of radius 5m with a speed of 10m/sec. What is the change in velocity when he has travelled through a semi-circle?", "A cyclist is riding a circular path of radius 5m with a speed of 10ms what is the change in velocity when he has travelled through a semi circle?", "A deck of 52 cards is shuffled and divided into two stacks of 26 cards. If you repeat this process 2000 times, each time checking the contents of each pile, how many times could you expect the number of red cards in one pile to match the number of black cards in the other?", "A dice is thrown once. What is the probability that the number is greater than 2?", "A disc is spinning on a spindle, and you don't know which way. You are given a set of pins. Describe how you would use them to determine which way the disc is spinning?", "A dishonest dealer sells goods at 30% of profit but uses only 800 grams in the place of a kilogram weight. What is his real gain percentage?", "A disk has a mass moment of inertia of 0.152 kg.m2. It has a mass of 1.536 kg, what is it's radius of gyration?", "A doctor who treat the health of a child in one word?", "A fair coin is flipped ten times. What is the probability of getting exactly 5 heads?", "A fair die is rolled 4 times. Find the probability that each number is no smaller than the preceding number? The answer of this question in the book is 7/72 . But I am unable to solve this question, can someone explain it to me?", "A fair die rolling 4 times, what is the probability of the sum is 12?", "A family has three children. What is the probability that they are all boys given that at least one of them is a boy?", "A famous saying is “magnets, how do they work’. How do magnets work?", "A father and his son are in a car accident. The father dies at the scene and the son is rushed to the hospital. At the hospital the surgeon looks at the boy and says \"I can't operate on this boy, he is my son.\" How can this be?", "A few volts of AC gives a shock but not DC. Why?", "A few zeros means?", "A finance commission of India is consider quasi- judicial body under article 280 of Constitution. Why? What is a characteristic of quasi-judicial?", "A flame always point upwards. Why do you think so?", "A flockof rebins is migrating southward .describe the flocks motions at instant whn its acceleration is (a) positive(b) negativeand (c) zero.?", "A force F=5t is applied on a block on horizontal surface of mass 10kg. If the coefficient of friction is 0.5, in rest what is speed at t = 20s?", "A force field travels at light speed. So what happens to a 'line of force' that is created by an electro magnet when that magnet ceases to exist?", "A friend of mine is having a thyroid problem (hypothyroidism) for over a year. She is 22 years old. In a recent medical checkup, the report said TSH is 17.5, which is way higher than normal. What are details of doctors, cures and experiences of people who had gone through the same?", "A friend on Snapchat has a smirk emoji beside their name on my list. What emoji, if any, will be by my name on their list?", "A friend recently told me, \"Don't have a thrombo\". What does this mean?", "A frieng has cleared his 1st & 3rd year but did not cleared his 2nd year supply. Class 2008-2011 .can he clear it now? How?", "A function with two different name saved in python file are giving different results unable to find the difference. What is it that I am not seeing? ", "A gentleman decided to distribute sweets to kids in his town. Out of the 612 children in his town, half of the girls and three fourth of the boys were present to take the sweets. The man distributed 12 sweets to each girl and 12 sweets to each boy. Determine the total sweets distributed by him?", "A girl makes eye contact with me in class what does this mean?", "A girl messages me everytime. I asked her out on a date an date, she agrees. She casually mentions her boyfriend? Why didn't she say from the onset?", "A girl of 50 kg travelling at 24 m/s hits a snowdrift and comes to rest 3s later. What is the average frictional force exerted on her?", "A girl says she always likes talking to me but doesn't know what it means (as in, if she likes me). What does this mean?", "A girl showed me her wound on her arm after I treating her very cold. Why?", "A girl tells me she is moving to mobile whenever I start the conversation. Why so?", "A girl told me she's a virgin, but I found out she masturbates a lot. Why would a girl who’s a virgin masturbate so much?", "A girl was going to college and a boy asked her name. The girl said: \"20 years 6 months\". What could the girl's name be?", "A glass slab is placed in the path of convergent light. The point of convergence of light:?", "A good coin is tossed 10 times. What is N(s)?", "A growth in the skin of 2 inches in diameter is what in centimeters?", "A guy from a lower caste cannot marry an upper caste girl, or vice versa, even if they love each other and nobody bats an eye. Why?", "A half-wave rectifier with a capacitive filter is connected to a 200 volts, 50 Hz AC line. What will be the output voltage across this capacitor?", "A hammer and a nail cost $1.10, and the hammer costs one dollar more than the nail. How much does the nail cost?", "A hand consists of 5 cards (52 card deck). What is the probability of getting 2 aces and 2 kings?", "A hand consists of 7 hand cards (52 deck). What is the probability of getting 2 red kings and 5 spades?", "A horse rider went a mile in 5 minutes with the wind and returned in 7 minutes against the wind. How fast could he ride a mile if there was no wind?", "A hospital didn't mention that a medical test is not covered through insurance before the test and later we got the bill.How can the bill be waived ?", "A hydrogen-like system has an ionization energy of 11808 kJ/mol. What is the number of protons in the nucleus of the system?", "A kilogram of antimatter was made in my lab and contained within a magnetic confinement chamber. Now if the chamber fails and the antimatter comes into contact with the environment, what exactly happens?", "A lemon kept in water in a glass tumbler appears to be bigger than its actual size, when viewed from the sides. Why does it appear so?", "A light ray bends towards normal when it travels from rarer median to denser medium. Why not away from normal?", "A line represented by [math]y = 3x − 1[/math] and a line perpendicular to it intersect at [math]R (1, 2)[/math]. What is the equation of the perpendicular line?", "A lizard was caught in glue. I spill some petrol on it to loosen the glue and help it escape. But it then die shortly after, I wonder why is it?", "A logic teacher said You don't have a brother and he likes cheese.how is this rational?", "A lot has been talked about 'How to love someone who is alive' but not many share their thoughts on loving the dead. Why?", "A lot of people would say 99 is like 100. Similarly 98 is like 99 which is like 100. So at what point is a number no longer like 100 and why?", "A majority of Quora said Donald Trump would lose. How do you feel now?", "A man and a woman produced some brown-eyed children and some blue-eyed children.What are the possible genotypes of the parents?", "A man covers 2.5km in 5 minutes. what will be the speed in km/ hr?", "A man dressed in all black is walking down a country lane. Suddenly, a large black car without any lights on comes round the corner and screeches to a halt. How did the car know he was there?", "A man goes into a restaurant, orders albatross, eats one bite, and kills himself. Why?", "A man has 53 socks in his drawer. They are 21 identical blue, 15 identical black and 17 identical red. The light went off and he is in complete darkness. How many socks must he take out to be 100% certain that he has a pair of black socks?", "A man is 13 times as old as his son is. In 10 years he will be 3 times as old as his son will be. How old are they now?", "A man is 5 times as old as his son 2 years ago the sum of square of their ages was 114 find the age of son?", "A man selling two articles for1080 rupees.On first he earns 20% profit and on other he earns 40% profit.what is his overall profit%?", "A man was murdered in his office. The suspects are Gerry, Julie, Jason, Nick, and Sophie. The numbers 6, 4, 9, 10 & 11 were written in a calender with blood. Who is the murderer?", "A married man keeps telling me he loves his wife and he likes me because we share the same horoscope. What is his true intention?", "A mixture of 40 litres of milk and water contains 10% water. How much water should be added so that the water is 20% in the new mixture?", "A morality issue with which I've been struggling, anyone who does not support the LGBT equality is a threat to me. At the same time, I want to support diversity. How can I reconcile those two facts in the context of Muslims given that a vanishingly small percentage of them support LGBT equality?", "A mother is 21 years older than her child. In exactly 6 years from now the mother will be exactly 5 times as old as the child. Where's the father?", "A mother is 21 years older than her child. In exactly 6 years from now, the mother will be exactly 5 times as old as the child. Where's the father?", "A mute went to a completely new place. He wanted to drink some water in a house owned by a blind person. How will the mute ask the blind person for water?", "A no. when divided by three no.s 9, 11, 13 leaves the remainders 8, 9 and 8 respectively. If the order of no. is reversed, then what will be remainder?", "A normal distribution with mean 37 and standard deviation 8.What is the probability a # selected at random from this distribution is greater than 37?", "A number being successively divided by 3, 5 and 8 leaves remainders 1, 4 and 7 respectively. What are the respective remainders if the order of divisors is reversed?", "A number is divided by 5,2 and 3 successively in order to get remainders of 0,1, and 2 respectively. What will be the remainders when the same number is divided by 2,3 and 5 respectively?", "A number that consists of 10 factors?", "A number when successively divided by 7 and 8 leaves the remainders 3 and 5 respectively. What is the remainder when the same number is divided by 56?", "A pair of dice is rolled. what is the probability that the sum of the number is rolled is an odd number and multiple of 3?", "A particle executes a simple harmonic motion of time period T. What will be the time taken by the particle to go directly from its mean position to half the amplitude?", "A particle is projected at 60deg with horizontal. The radius of curvature at point of the trajectory is 10m if the velocity is 4x m/s find x?", "A particle moving with constant velocity it's average velocity it's instantaneous velocity and it's speed are all equal. True or false.Explain why?", "A particle starts with initial speed u and retardation a to come to rest in time T.The time taken to cover first half of the total path travelled is?", "A particular blood cell has an internal osmolarity of .30 osmol. Which solution should this cell should be placed in if one wanted to shrivel it?", "A payment of $800 on an invoice for $1887 reduced the balance owed to $1070.67. What cash discount was allowed on the $800 payment?", "A person has two parents, four grandparents, eight great-grandparents and so on. How many ancestors does a person have 15 generations back?", "A person is chosen at random. What is the probability that person was not born in July?", "A person named Kirti Ambani was accused of eliminating Nusli Wadia? Were is he now? What is his relationship with Ambani family?", "A person rapes a girl and she gets pregnant . If she comes to you asking whether to keep the baby or not, what would your answer be? Why?", "A plan offers unlimited data and 1 GB of LTE Data, what does this mean?", "A plane mirror reflects a pencil of light to form a real image. What is the incident of the pencil of light on the mirror?", "A plot problem. A Colt .45, with interchangeable barrels was identified by police ballistics as being the murder weapon. How would they know?", "A point charge +Q is placed at a distance d/2 above the center of a square surface of side d. Find the electric flux through the square.", "A point charge Q is located just above the centre of the flat face of a hemisphere of radius R as shown in the adjacent figure. What is the electric flux through curved surface area and through flat surface?", "A point charge q is located at a distance l from the infinitely conducting plane. What amount work has to be performed in order to slowly remove this charge very far from the plane?", "A point of mass is connected to one end of the inextensible string of length l and the other end of the string fixed to the peg. The string is free to rotate in a vertical plane. How do you find the minimum velocity given to the mass in the horizontal direction so that it hits the peg in its subsequent motion?", "A polynomial leaves remainder [math]2[/math] when divided by [math]x-1[/math] and remainder [math]1[/math] when divided by [math]x-2[/math]. If the polynomial is divided by [math](x-1)(x-2)[/math], then what would be the remainder?", "A pond is the habitat of many plants and animals identify three plants and three animals living in a pond?", "A projectile is fired at an angle of 30. At what angle with the vertical will it hit the ground?", "A quadratic equation has the square of the sum of its roots equal to four times the product of its roots. What is the discriminant of the equation?", "A question for the atheists. What would God have to do to convince you God exists?", "A question mark shows when I boot my MacBook Air. What happened?", "A rabbit, a cabbage, a fox, and a farmer are at a river. The farmer has one boat fitting one item and himself. If he takes the fox, the rabbit will eat the cabbage. If he takes the cabbage the fox will eat the rabbit; however, the fox will not eat the cabbage. How does he transport them all safely?", "A ray diagram for concave mirror shows no image is formed at \"f\" but when looking into concave mirror, one can see an image of themselves. Why?", "A reaction proceed with no evolution or absorption of heat, the equilibrium constant at temperature T1and T2 are?", "A reacts with socl2 and give propan1ol?find what is A?", "A recent study says \"microlending programs had little to no effect on participants’ income or financial well-being\", what does this mean for Kiva?", "A rectangle has an area of 100 cm². The base of the rectangle is 25 cm. What is the height of the rectangle?", "A rectifier converts AC into DC but still the output of half-wave and full wave rectifier is sinusoidal. Why?", "A reduction of 20% in the price of rice enables a person to buy 3.5 kg more for Rs. 77. What is the original price per kg?", "A regular hexagon is inscribed into a circle. What is the length of the side of the hexagon if the radius of the circle is 12 cm?", "A regular polygon has 14 diagonals. how many sides does the polygon have?", "A resistance of 10 ohm is connected in series with two resistances each of 15 ohm arranged in parallel. What resistance must be shunted across this parallel combination so that the total current taken shall be 1.5A with 20V applied?", "A review was posted by me on a Google Plus business page three days back. Now it is not seen either in my Google Plus profile nor in the Google Plus business page where I had reviewed. What could be the reason?", "A scientific theory or hypothesis must have a falsification criteria to be considered valid. What is the falsification criteria for dangerous global warming?", "A security has a price equal to the exercise price on its European call option. What's higher the premium on the call or the premium on the put?", "A senior researcher on my wife's thesis committee just scooped her by doing the same experiment she is. What form of redress does she have?", "A sequence is defined recursively using the formula f (n + 1) = –0.5 f(n) . If the first term of the sequence is 120, what is f(5)?", "A side of a square paper is 30 cm. What is the area of the biggest possible circle cut out from it?", "A simple pendulum bob has a mass of 1kg. What is the frequency of this pendulum?", "A simple pendulum is suspended in a car traveling with a constant speed around a circle. What is the frequency of oscillation?", "A single 18 wheeler with a gas tank seems small to be filling up massive gas stations. How does this work?", "A single B-2 stealth bomber costs about $1 billion. How is this possible?", "A slums girl top in metric exams? How did she managed to study in there?", "A space ship moves at speed 60%c. an observer inside the space ship measures it's length (spaceship) is 60m, What will an oberver on Earth measure?", "A sphere has a diameter of 2,160 meters. How many meters long is “Unit X” if the surface of the sphere, measured in square Units X is equal to the volume of the sphere measured in cube Units X?", "A square, a rectangle and right angled isosceles triangle have the same perimeter. out of these three, which figure has the greatest area?", "A stone falls from a cliff and travels 34.3m in the last second before it reaches the ground. What is the height of the cliff?", "A stone is dropped from rest from the top of a tower 19.6m high. What is the distance travelled by its last second of fall?", "A stone is projected vertically upwards with speed 17.5m/s. The length of time for which it is at least 6.6m above its starting position is D/7 seconds. What is the value of D?", "A stone is thrown downwards from a building 500m high. At the same time a ball is thrown upwards with an initial velocity of 5m/s. When do they meet?", "A stone is thrown vertically upward with a initial speed of 19.5m/s. What is the maximum height which it covers?", "A stone is thrown vertically upward with a velocity of 19.6 m/s. After 2 seconds, another stone is thrown upwards with a velocity of 9.8 m/s. When and where will these stones collide? Please answer the question with a step-by-step solution.", "A student dissolves 20g of salt in a pan of 200 mL of water. How much salt is left after all the water evaporates?", "A student multiplied a number by 3/5 instead of 5/3. What is the percentage error in the calculation?", "A student multiplied a number by 3/5 instead of 5/3.what is the percentage error?", "A sum of money is to be distributed among A, B, C, D with  ratio 5:2:4:3. If C gets 1000 more than D then what is the share of B?", "A teacher of mine told me Scientific American was not a credible source and told another student Answers in Genesis was. She gave me a C on this assignment while giving the other student a higher grade. Is there anything I can do about this?", "A television camera is 30 feet from the sideline of a basketball court that is 94 feet long. The camera is located 7 feet from mid-court. Through what angle must it sweep in order to cover all the action on the court?", "A temperature of a body decreases from 40°C-30°C in 10 minutes. Temperature of its surroundings is 15°C. What will be the temperature of that 5 minutes later?", "A theoretical war breaks out between 3 factions, each respectively composed of biologists, physicists and chemists. Who would win?", "A train moves on rails from A to B. It goes from A to B with speed 60km/hr and returns from B to A with speed 40km/hr. What is the average velocity?", "A train starting from a railway station and moving with uniform acceleration attains a speed of 40km/h in 10 minutes. What is its acceleration?", "A trapezoid is inscribed in a circle. How to find the radius of the circle?", "A truck is moving 60 mph, I throw a ball when inside the truck at 60 mph in the opposite direction of the vehicle's motion. How would the ball travel?", "A two digit number is 18 less than the square of the sum of its digits. How many such numbers are there?", "A user has read messages I sent but there is still 2 grey ticks. Why?", "A vacuum is maintained in the condenser so that steam can easily flow and more work can be extracted from the steam in the turbine. How does the condensate extraction pumps take suction from such a low pressure condensor?", "A value-returning method can also be invoked as a statement in Java. What does this mean?", "A voltmeter, an ammeter and a cell are connected in series. It is observed that ammeter practically shows no deflection. Why?", "A wire of resistance 36 ohms is bent into an equilateral triangle. What is the resistance between its vertices?", "A woman had two sons who were born on the same hour of the same day of the same year. But they were not twins. How could this be so?", "A young black man has had his charges dropped. He's waited over a year for now VP elect Pence to sign for his release. How does he get released now?", "A,B and C can do a piece of work in 4,5 and 7 days respectively.They got Rs. 415 for the job.What is A's share?", "AAP has said that it is against corruption. How effective is the health system in Delhi?", "AD in history?", "AIDS then, now Ebola. What is wrong with Africa? Why do most dangerous diseases originate in Africa?", "ANALYSIS ON endangered species?", "AO CODE OF IMPHAL?", "AOSDHIADSOIHADSO DASODASHDASOH", "ATS: What are the ways to migrate data from one ATS (applicant tracking system) to another? What are unexpected challenges with data migration?", "A^3-b^3 what is the factor of that?", "Aam Aadmi Party was formed with a sensible agenda. Why has been the party embroiled in controversies lately?", "Aaron Rodgers says \"Green 18, Green 18\" before the ball is snapped. What are other cadences used by NFL quarterbacks?", "Abbreviation of BRS?", "Abdomen pain on deep breathing...what can be the cause?", "Abnormal Psychology: What does it feel like to have borderline personality disorder?", "Abnormally high TSH, normal T3 and T4. What does it mean and how can it be controlled?", "About 20 years ago, I believe it was Goodyear, they hammered us with commercials about a new highway surface that would last forever. What happened?", "About 50% of the world population is concentrated between the latitudes of?", "About Abdul Kalam?", "About Indian polity?", "About MARATHA MORCHA?", "About craftsman company?", "About how long does it take to read The Fountainhead by Ayn Rand?", "About how old are first year cardiothoracic residents?", "About nuclear energy?", "About the country－Japan?", "About the country－Japan? (in japanese)", "About the country－Japan?(in chinese)", "About what percentage of the cells in your body contain the same genome since birth?", "About what percentage of the cells in your body contain the same genome?", "About “This sentence is false.” What is the answer?", "Above the door and window, a level is present what is it?", "Abraham Lincoln was an anti-slavery Republican, opposed at the time by the Democratic Party. Why do most African-Americans now favor Democrats?", "Abraham Lincoln: Why is the Gettysburg Address so memorable?", "Absent a god or gods, what is our payback for good deeds?", "Abstract and interface class?", "Accenture is offering me CTC of 13.28 lakh, 11 fixed and 2.28 is variable. What will be the take away salary per month after all deductions?", "According to Adrián Lamo, who is going to win the U.S. presidential election in 2016?", "According to Alexa, 10.4% of Reddit's traffic comes from India. This is the second largest chunk after the United States. How has Reddit achieved this?", "According to BLS statistics, never married women earn 95.2 percent of what never married men earn. What are the problems with using this to claim that wage discrimination differential must be 4.8 percent or less?", "According to Christianity how can we be happy in life?", "According to Christianity, If Jesus is God, then who is the last prophet?", "According to Christianity, is God Jesus? Why?", "According to Christianity, when will Jesus come back?", "According to Dante, what are the 7 layers of hell?", "According to Dante, what are the seven levels of hell?", "According to Genesis when God created Adam and Eve, they gave birth to Cain and Abel and Cain killed his brother. Where did Cain get his wife?", "According to Greek mythology, how do sirens die?", "According to Hindu Mythology, how many immortals are still there?", "According to Hindu mythology, how many times has Shiva opened his 3rd eye and why?", "According to Hindu myths, how did Lord Ram, Lord Krishna, Lord Laxman die?", "According to Hindu rituals, why are the married adults and some unmarried teenagers cremated (burnt) while the unmarried (saints & babies) buried after they die?", "According to Indian constituency article 24 child labour is prohibited. Does that mean the children who are working in Bollywood and dramas are not doing labour, but the children working in industries are doing labour? Why this distinction?", "According to Indian mythology, who are the seven immortals?", "According to Indians a small gap between jeans and top is shameless and a 6 inch gap between saari and blouse is traditional, why?", "According to Islam, Who is God?", "According to Islam, if Allah created the entire universe, why does He care if woman show their hair?", "According to Islam, what are the signs of Qiyamah (Day of Judgement?)", "According to Islam, what happens to people in the afterlife who lived before Muhammad?", "According to Kashmir issue what exactly Pakistan want from India?", "According to Kashmiris what would be the ideal solution to the Kashmir conflict?", "According to Marx, what would happen after social classes were abolished?", "According to Mendel's law of segregation what happens to chromosomes during meiosis?", "According to Muslims, a terrorist can't be a Muslim then why they don't file a suit against them for the misuse of the name of Allah?", "According to Newton's third law of motion, every action has an equal and opposite reaction. But when we move an object, why does it move?", "According to Newton's third law, each team pulls the opposite team with equal force in a tug of war. Why is it then one team wins and the other loses?", "According to Wikipedia, the US, Canada and Australia have some of the highest greenhouse emissions per capita. Why is that?", "According to a recent news report, only 4,000 students got a US student visa out of 90,000 who had applied. Why were so many students rejected?", "According to believers, what is the \"afterlife\"?", "According to doctors, how does a person feel when they're dying?", "According to garuda purana, how can a child conceived through IVF be differentiated from an inauspicious soul?", "According to jainism, what happens when all the souls are liberated?", "According to kinetic theory of gases the absolute temperature of a perfect gas is?", "According to mainstream physics, what is there outside the Universe?", "According to newton's third law of motion every action has an equal and opposite reaction but why don't they cancel out each other?", "According to ohm's law, V is proportional to I (V=IR), but in case of power V is inversely proportional to I (as P=VI). Why is it so?", "According to polls who won the first Clinton-Trump presidential debate?", "According to real life point of view, when should we use differentiation or integration?", "According to science what happens to the soul after death?", "According to science, how did time begin?", "According to string theory there are 11 dimensions; what are those dimensions?", "According to string theory, why is earth rotating around the sun on an ellipse, while gravitation field of the sun should be almost perfect circle?", "According to superstition, what does it mean when your left eye jumps?", "According to the Bible, Hell is a place where sinners and Satan will be kept (and tormented) for all eternity. So why is Satan often depicted as a lord or master of Hell in popular culture?", "According to the Bible, how and when did Creation take place?", "According to the Bible, what are some of the promises that God has made?", "According to the Bible, what do cherubim and seraphim do?", "According to the Bible, what is the rapture?", "According to the M-theory, there are 11 dimensions. Why are only 5 dimensions in regards to gravity addressed in Interstellar?", "According to the National Highway Traffic Safety Administration study of multi fatal collisions how many drivers had drugs other than alcohol in their bodies?", "According to the Qur’an, why did Allah order the Jews to kill themselves?", "According to the concept of limit state design as per IS 456:2000 , the probability of failure of a structure is?", "According to the theory of evolution, why do we die?", "According to traditional Judaism when did creation take place? For example, how long ago did Adam and Eve live?", "According to you, what is Love?", "According to you, what is the meaning of money?", "According to you, who is Rajiv Dixit?", "According to your prediction, in how many constituencies will the winning margin be less than 1000 votes? And in which constituencies do you predict it will happen?", "Accounting standards by jawaharlal?", "Acronyms: What does 1:11 mean when used on Twitter, Facebook, and Instagram?", "Acronyms: What does EEUU stand for?", "Acronyms: What does LP stand for??", "Acronyms: What does SWAG stand for?", "Acronyms: What is the full form of ISIS?", "Acting: How are actor salaries determined in film and theatre?", "Acting: What are some of the telltale signs of a bad actor?", "Acting: What is the difference between film and theatre actors?", "Acting: Why is it hard for an actor to play \"drunk\"?", "Actor Robert Williams who makes the whole world laugh with his works has hanged himself. What kind of a man would do this?", "Actually what is dating?", "Adam D'Angelo: How did you come up with the name \"Quora\"?", "Adam D'Angelo: What did Quora's MVP look like, and how long did it take to build?", "Adam D'Angelo: What do you think of GiveWell?", "Adam D'Angelo: What is Quora's monetization strategy?", "Adam D'Angelo: What specific steps is Quora taking to address the lack of diversity in their leadership?", "Adam D'Angelo: When will Quora have night mode?", "Adam Nash: What differentiates Wealthfront from other roboadvisors?", "Addiction: Why is Marijuana illegal but not Nicotine?", "Addition of phosphate buffer, starch solution, saline solution and distilled water results to 2 layers why?", "Administration of atropine in organophophorous poisioning?", "Adobe Photoshop: What are the differences between a PSD and a PSB file?", "Adult Dating and Relationships: Girls, how does it feel like the first time you undressed for a guy? Guys,how does it feel when you see a girl naked for the first time?", "Advantage and disadvantage of curd?", "Advantage and disadvantage of custom rom?", "Advantage and disadvantages of demand curve?", "Advantage of diesel engine from the gas turbine?", "Advantage of eating eggs?", "Advantage of fluid coupling over normal coupling?", "Advantages and dis advantages of commerce?", "Advantages and disadvantages of Fedora?", "Advantages and disadvantages of indian culture?", "Advantages and disadvantages of young people?", "Advantages of H-Arm suspension?", "Advantages of Myriad Pro as copy?", "Advantages of chemistry?", "Advantages of cybernetics?", "Advantages of green computing?", "Advantages of health care BPO?", "Advantages of leadership?", "Advantages of limit state method over the working state method?", "Advantages of non SI units?", "Advantages of short pitch winding in an alternator?", "Advantages of solid shaft?", "Aerodynamically what happens when propellor rotates?", "Aerodynamics: What is the role of Angle of Attack in airfoils?", "Aerodynamics: Why do some airplanes have rounded noses and not pointed?", "Afghanistan: What do Afghans think of Hamid Karzai?", "Afghanistan: Who do Afghans consider a worse invader, Soviet Russia or America?", "African History: How was Ethiopia able to resist European colonialism for so long?", "After 1 year of Modi's government, what has India got to say?", "After 2.5 years of Modi government, what are the changes in lives for the middle and lower class?", "After 50 years of support for the Democratic Party, most African Americans are no better off than they were before. Under President Obama, there twice as many in poverty than under Bush. So, why do African Americans still vote 80%+ Democrat?", "After Egypt and Libya, where will the next Arab Spring be. Is it Bahrain?", "After I get graded on a test, I am too scared to look at my wrong answers and why I got them wrong. What could be explaining this behavior?", "After I give a presentation I feel exhausted. Why does this happen? Am I too nervous?", "After I stand up very fast I get a very dizzy wired feeling. it's the most euphoric amazing feeling in the world for 5 seconds. What is this?", "After Japan took its goals in WW2 Pacific camapign, what percentage of pre-war raw material supply and production was Japan able to recuperate?", "After Jayalalithaa's death, who will be the new chief minister of Tamil Nadu?", "After Sharktank how can Poggled compete with EZ VIP?", "After VSD Closure there is a leakage in heart again, what should be done?", "After a failed landing attempt, why does a pilot immediately pull up the plane's landing gear?", "After a first date, the guy reaches out to me and says sorry, we can not take this further, we're too different. What does this mean? Do you think there could be something more than that?", "After answering or passing on all the questions sent to me, why does the little Answer icon still have a 1 on it?", "After being scratched by a cat, what does it mean if the wound is itchy?", "After currency devaluation in a country, how is debt handled between individuals? Should we consider the old value, or the new one? Thanks in advance!", "After deactivating Facebook mesgger shows prfile in gre y why?", "After demonetization and a cashless economy, what is the next step that the Indian government should take for India?", "After demonetization, what will be the next move?", "After destroying the ring, why does Frodo leave Middle Earth?", "After examining the \"westernization\" of Russia under Peter the Great, how was Russia transformed and what was its success?", "After hearing the knowledge of The Gita, that too from Lord Krishna, why did Arjuna go to hell?", "After many years our government get to know that the residential construction which has been developed is illegal, why so? And on other side they are developing big building for slum resident?", "After marriage, why do women have to change their surname?", "After marriage, why do women have to change their surnames to their husband’s? Why can't they keep their maiden ones?", "After movies like Sarkar and Guru, why did Abhishek Bachchan stop doing definitive cinema?", "After my car runs for a while, the clutch gets very hard to press and the gears do not engage. Why?", "After police verification they stated my brother is not a citizen of india.i have passport, with same parents, address document.what can be the reason?", "After pooping I can think better. What does that mean?", "After realizing that this universe is a simulation, you became an omnipotent. would you rather become god or would you seek the true reality? Why?", "After shooting meth, what causes numbness burning and swollen knot at injection site?", "After shooting meth, what causes numbness, burning and a swollen knot at the injection site?", "After such a circus, what does Trump endorsement of Paul Ryan exactly mean?", "After surgery for an inguinal hernia repair, what does it mean if a bulge is still present?", "After switching a job (2-3 years), how much is the percentage salary hike average among the Indian manufacturing companies?", "After the British defeated the Dutch Boers in 1870 what surname were they given?", "After the Trump debacle of 2016 where does the Republican party go from here?", "After the U.S. dropped a nuclear bomb on Japan why did Japan fight back?", "After the U.S. dropped a nuclear bomb on Japan why didn't Japan fight back?", "After the elections, what does Barack Obama think of Donald Trump?", "After the first US Presidential debate between Trump and Clinton, who do you think has the upper hand and why?", "After the horrific attack on a pregnant woman in London, what is \"Child Destruction\"?", "After the independence of India in 1947, why were Indian and British flags raised equally? Why wasn't only India's flag raised?", "After the launch of PM Jan Dhan Yojana, what is the total number of bank account holders in India today, both old and new combined? Also how many more accounts need to be opened to cover all families in India?", "After understanding that everything is made of quarks, leptons and bosons, how do I not view the world as pointless?", "After watching \"Hacksaw Ridge\", my question is why didn't the Japanese just cut that rope ladder?", "After winning a cricket match while chasing one of the batsman on the crease takes with himself the middle stump. Can anyone tell me why only the middle one?", "After witnessing the horrific violence against Hindus in the only Muslim majority state of Kashmir in India, how can I be assured that Muslims won't do the same when they become the majority in any of the Indian States?", "Against powerful people who polluted river water in India Gujrat?", "Aggregators and Content Aggregation: Didn't utopic.me used showed news of my social network? why have they changed direction?", "Aghori: What drives someone to be an aghora?", "Agile Software Development: What are some excuses you have heard why a team member does not want scrum?", "Aging Brain: How do the brain structures of gorillas change as they age? How are these structural changes different from human brains?", "Aging Brain: How do the brain structures of zebras change as they age? How are these structural changes different from human brains?", "Agriculture: Why Indian governments don't do much for farmers , they are the majority voters in India still govt. don't give any attention to them ?", "Air India flight 619 Incident: Ground Staff got sucked into the jet engine, what was the Physics involved? What are the critical things he missed?", "Air Pressure: What is the difference between the units psi and psig?", "Air polution effect causes and prevention?", "Airbus A330/350: Why is there a sudden drop in allowed temperature to operate in, at or around 16,600 feet?", "Aircraft Design: What are the dimensions of an airline tray table?", "Airlines: How safe / dangerous are tyre bursts during a landing? How tough is it, for a pilot in case of such an unfortunate event? Does weather play a crucial role during such cases? How often does it happen?", "Albert Einstein called nationalism an infantile disease and considered patriotism an attempt to soften nationalism, but saw that it was no different. What is the value of nationalism/patriotism?", "Albert Einstein reportedly said: \"The true sign of intelligence is not knowledge, but imagination\". What did he mean?", "Aleppo: Why doesn't anyone talk about what happened in Aleppo?", "Algebra: Why is [math]\\frac{8}{\\sqrt{2}}[/math] irrational?", "Algorithmic Game Theory: What's the difference between dominant strategy solution and Nash Equilibrium?", "Aliens (1986 movie): How many years was Ripley asleep?", "All about service tax?", "All mobile numbers are ten digits. What is the reason for this?", "All my answers are collapsed. Can someone tell me why?", "All of my friends and even some of the people I don't even talk to say that I am bipolar. I don't agree with them at all. How do I know if I actually am bipolar?", "All of my questions are marked \"needs improvement.\" Why?", "All of the following elements are included in the transactional communication model except? Sender, message, channel or environment.?", "All of the following statements characterize the Battle of the Argonne Forest except what?", "All of the intellectuals I have met like Star Wars/Star Trek kind of movies. Why is that?", "All over the news lately they talk about Russia and US on the brink of war. How likely will a war happen?", "All the digits in a 14-digit number are 5. Find the remainder when the number is divided by 74?", "All these news ppl r talking about how ice is our biggest enemie. I like ice cause it cool my drinks, y is everone now hating ice?", "All weapons used by terrorists are made and provided by west. Why nobody blames west?", "Allergies: why are some allergies more common than others?", "Almost two weeks in on Prozac, why do I still feel antisocial and still don't want to go to events? Why does my social behavior and mood change daily?", "Alpha Force Testo Its Build Muscle Mass?", "Already a chat read can go to grey lines after a day? And if it has what does it mean?", "Altair Hypermesh: What is meshing in ansys? Please answer in detail in lay man's language?", "Altec Lansing mini portable H20 speaker. The question is: They say it's waterproof. What about the AV port/ what kind of AV cord do I need?", "Alternate Histories (Hypothetical Historical Scenarios): How different would the world be if World War I and World War II had not happened?", "Alternate Histories (Hypothetical Historical Scenarios): How would the economic and political world be impacted if the USSR never declined?", "Alternate History (Hypothetical scenario): What if superheroes and supervillains emerged in 1970s Australia?", "Alternate History Scenario: What would happen if the Russian Revolution of 1917 never happened?", "Alternative Rock Music: Why are so many British band names preceded by \"the\"?", "Although I read that IQ is a constant value and can not increase after the age of 10 years, but why every new IQ test giving new results, with the same person? If it is, then how can we trust, on anyone's IQ is constant or not? or Is it can be increase or decrease by the time?", "Although India is a democracy, why is the official name of the country Republic of India?", "Although light beam bouncing between two plates inside a clock is often used to explain time dilation, how can other practical cases be explained?", "Am I allowed to get a sneaky peak. What does sneaky peak in this sentence means?", "Am I right to state that whenever a non-Muslim commits an act of terrorism the Western media are always keen to ascribe reasons like insanity and medical conditions for these acts? Why don't Muslims get the same treatment?", "Am what is answer wiki?", "Aman Goel: How was your experience at US internship (Rubrik Inc.)?", "Amazing facts about female body?", "Amazing pictures of earth?", "Amazon interview: what is the best answer to the question \"why Amazon?\"?", "Ambition: Why do you wake up every morning?", "America declared independence on July 4th, 1776. What else was founded in 1776?", "America has a famous cliche or meme about heavy petting in the back of a car. What would be an analogous cliche for this in France?", "America has a famous cliche or meme about heavy petting in the back of a car. What would be an analogous cliche for this in Italy?", "America is divided into how many class of people?", "America is divided into how many classes of people?", "American Culture and Society: Why are Filipinos not considered Latinos in the USA?", "American Exceptionalism: Why couldn't the USA led coalition of 60 countries destroy ISIS in Syria during its 5 year campaign yet Russia has almost done it in 4-5 months?", "American Revolution and Revolutionary War: Why did Benjamin Franklin reveal Thomas Hutchinson's personal letters?", "American journalists seem to be afraid of Donald Trump - who is Donald Trump afraid of?", "American people, who was the beautiful lady sitting right beside Donald Trump in today's charity dinner event when he was speaking?", "Americans seem to have a reputation for knowing very little about the rest of the world. Is this a fair assessment, and if so, what might cause their general lack of knowledge?", "Americans, what will you do if Trump wins?", "Amnesia: How can a person remember his language or the place etc when he is suffering from amensia?", "Among IRS (IT) IRS (C& CE), which option is being given more preference nowadays? Is there any particular reason behind it?", "Among large US Newspapers, which are considered conservative and which are considered liberal?", "Amongst the major religions practised in the world today why is there never a female prophet, pope or priestess?", "Amount of fresh water on earth?", "Ampthill, Bedfordshire, UK: What would be the pros and cons of pedestrianising the town centre?", "An AC voltage has a peak value of 200 volts. What will the RNE voltage be?", "An Italian bank wrote off 9 billion Euros worth of bad debts, and got 5 billion worth of investment. Where exactly has the money come from and why?", "An adult who doesn't age gets stuck 2000 years in the past. How could he/she survive throughout history to reach today?", "An alloy is mixing copper, tin and zinc in the ratio of 10:12:9. If only 28 kg of copper is used how much tin and zinc is needed to make the alloy?", "An aqueous solution has a concentration of 20.0 % MgSO4 by mass. What is the molality of this solution?", "An aqueous solution of urea has vapor pressure 21.15 mmHg & Vapor pressure of pure water 25.15 mmHg. How to 500 mL solution? Density =1.06 g/mL", "An article on conservation of water?", "An atom exists in which state, solid, liquid, gas, plasma, or BEC?", "An atom has electrons, protons and neutrons. But what's in the electrons, protons or neutrons?", "An electric current is passed through an aqueous solution of lithium bromide. What is produced at the cathode? What is produced at the anode?", "An electric iron has a rating of 750W , 220V. Calculate the current passing through it and its resistance when in use?", "An essay in Hindi on अपने जीवन का एक सहस पूर्ण प्रसंग का वर्णन कीजिए", "An example of an output device is a?", "An explanation of the term Yahweh in ancient epoch?", "An iceberg is floating on sea water such that only 10% of its volume is above the water level. What is the density of the sea water expressed in terms of the density of ice?", "An important property of Shellsort is that an hk-sorted file that is then hk-1-sorted remains hk-sorted. How do you prove it?", "An isoceles trapezium is inscribed in a circle of sides 18 cm and 32 cm,what is the radius of the circle?", "An object of 2cm height is placed 10cm in front of a convex mirror forming an image of height 3cm. Find the focal length.?", "An old photo on my Instagram feed from two weeks ago will now not load. It is just grey and when I open it there is a reload arrow but when pushed nothing happens. What is happening?", "Analog vs digital filters?", "Analogues of data market feed, like BATS?", "Analyse four main functions of the vehicle braking system?", "Analytical Chemistry: What are the limitations of FTIR?", "Analyze the Russo afghan war with respect to fighting techniques, training standard, moral and logistic system?", "Anatomically and physiologically speaking, the vagina is a disgusting organ. Why do men love it so much?", "Anatomically, what gives someone a good singing voice?", "Ancient Greece: What happened after the Trojan war?", "Ancient Hindus sailed from India through Southeast Asia bringing Hinduism there. Why didn't they also sail to Madagascar from India and make it Hindu?", "Ancient Hindus sailed from India to Indonesia. Why didn't they sail further to discover Australia? Why didn't Dutch discover Australia from Indonesia?", "Ancient History: Which civilization is older - Indus Valley or Chinese Bronze Age?", "Ancient India: During the Vedic period, Hindus used to offer animals for yajna, especially by Brahmins. Who used to eat that meat, if Brahmins were not supposed to?", "Ancient Romans spoke Latin.  Modern Italians speak Italian.  When did Italian become the language of Italy?", "Ancient Rome: What did Marcus Agrippa's Pantheon originally look like?", "Ancient Rome: What type of modern government is the closest to the Roman Republic?", "Ancient man schizophrenic?", "Andhra Pradesh, India : Why is there a need for a separate Telangana state?", "Andrew Ng: What are your thoughts on Bayesian Program learning which promises to outperform traditional learning algorithms whilst using less learning data.?", "Andrew Ng: What do you think of Microsofts CNTK?", "Andrew Ng: What do you think of provable guarantees for algorithms in machine learning?", "Andrew Ng: What role will Machine Learning play in the future of education, if any?", "Android Phones: How much difference does a 512MB RAM make even if I have a handset that is powered by a dual core processor?", "Anesthesiology: How does chloroform knock people out?", "Angel Investing is catching up quite a bit in India but with limited 'next round of funding' and 'exits', what do you think the landscape would look like 5 years from now?", "Animal Behavior: Apart from lions, and families consisting in mothers with dependent pups, do you know other felidae that live or can live and hunt in groups?", "Animal Behavior: Why does my dog enjoy licking me?", "Animal Behavior: Why does my dog hate being confined (in a room or a crate) yet loves getting under the table where she is confined?", "Animal Identification: Can you identify this large flat green spider of the Phillipines?", "Animal helping trusts information in Mumbai?", "Animals &human different?", "Animals: Why does a male dog lift its leg to urinate?", "Anime: In which episode will we see Luffy's gear 4th?", "Ankur Warikoo: How does the new Startup policy by Indian Govt. seem to (help/not help) the Indian startups?", "Antarctica: What do we know about lakes in the Antarctic?", "Antiques: How can you determine the age of brass, bronze, or copper statues?", "Any body know the value of a Mayan Snake flute gold in?", "Any difference between bucket sort and radix sort for integers?", "Any examples of  the mind-blowing, awesome arguments given in the court of law by which the case turned around?", "Any examples of mathematical statements that were considered axioms until eventually proven false hundreds of years later?", "Any feedback for Tea Garden Resort in Wayanad, Kerela?", "Any five difference between accounting and accountancy?", "Any have guess what will the speech by Narendra Modi on new year Eve?", "Any idea about anti-virus hardware appliance that can have email notification capability when virus signature is identified?", "Any ideas about inovation in invisible architecture?", "Any one tell me about Moto g4play specification?", "Any opinions about Luke's English podcast?", "Any unanswerable questions? For example what does water taste like?", "Any updates on Baahubali- The Conclusion?", "Anyone kindly give me the link for Quantico?", "Anyone seen the kuwait-iraq attack of 1990 ? What actually the scene was?", "Apache rtr 2004v vs Pulsar 220f?", "Apart from Brazil and Russia, which countries use the accordion in their pop music?", "Apart from Brazil and Russia, which countries use violin in their pop music?", "Apart from Germany, why hasn't any country apologized, acknowledged, or paid restitution for war crimes & destructive policies?", "Apart from Red rooster silencers which all silencers does not affect the milage of a royal Enfield bullet?", "Apart from being given by God which are the arguments to legitimate Israeli settlements in Palestine?", "Apart from demonetisation and issuing 2000 currency instead of 500 & 1000 what are the other foolish things done by this government?", "Apart from fundamental rights, how does the Indian constitution protect its citizens from the government's power?", "Apart from religion, how different is Prime Minister Narendra Modi from the previous PM, Manmohan Singh?", "Apart from size and name, what do new micro and nano SIM cards offer?", "Apart from tardigrades, what are the other living species that humans can't kill?", "Apart from the Gospel of Thomas, what other gospels have been excluded from the Bible and why were they left out?", "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios: What would happen if a high-yield, high powered energy device were to hit Florida and cover the majority of the state in a sphere of extremely (cold) temperatures?", "Apparently eth is virtually unlimited in terms of supply. So where does it derive its value?", "Apparently less than 2% of the uranium in Little Boy actually detonated. What would the aftermath look like if 100% of the uranium went off?", "Apparently our hair self cleans. So why do we use products to clean it?", "Apple car: project Titan, what are your expectations?", "Apple is finally opening its stores in India and it will skip resellers. How is it going to be helpful for the consumers?", "Apple v. Samsung (2011–12): How do the two sides get the emails and documents from each other?", "Apple: Why time is displayed as 9:41 AM in Apple iPhone advertisements?", "Application of die steel?", "Applications 4 bit asynchronous counter?", "Applications of scott connection? Where it is used?", "Applying olive oil on face every night. What are the pros and cons?", "Approx. how much money is in Scrooge McDuck's vault?", "Approximate estimate of a poultry farm of 5000 birds?", "Approximately how many bags of cement are required for a 1500 square foot house?", "Approximately how many birds collide with each other during flight each day? I know stupid question, but I was curious.", "Approximately how many processors does Amazon buy from Intel each year?", "Approximately how much a naval demagnetization facility costs?", "Approximately how much does a Chevy G10 van weigh? Model year 1993 if possible.", "Approximately how much does a Chevy G10 van weigh? Model year 1993 if possible.?", "Approximately how much does it cost to refuel a Boeing 747?", "Approximately how much gold is estimated to still be undiscovered? How is this estimate reached?", "Approximately how old is the earth?", "Approximately what is the ratio between development cost and a single launch cost for a rocket?", "Approximately what percentage of eligible Americans voted in the 2012 presidential election?", "April 2016: How is Soylent doing? Is the company and the product a success?", "Arabic (language): What is the meaning of \"wa alaikum salaam\"?", "Are Ble and Bluetooth 4.0 same? If yes, then why does Windows phone support Bluetooth 4.0 but not Ble?", "Are Charger cops better than Crown Victoria cops? Why doesn't every cop have a Charger?", "Are Malayali girls more beautiful than others? Why do most people say so?", "Are Max Weber's Ideal type a list of stereotypes? Which are used as measuring rods to measure existing reality?", "Are SIMPs what ripple when galaxy clusters collide and what wave in a double slit experiment?", "Are YouTube subtitles and their translations generated algorithmically? How?", "Are all theories about conspiracies conspiracy theories?", "Are animal cells prokaryotic or eukaryotic? How is this determined?", "Are atheists more enlightened than theists? Why?", "Are electrons made of quarks, what are they made of?", "Are entrepreneurs born or made? What's your reasoning or evidence?", "Are eyes considered part of the brain? What is the nature of the nerve signs from the eyes?", "Are fish considered to be mammals or amphibians? Why?", "Are fundamental particles singularities? If yes, what are some similarities with black holes?", "Are most evolution \"skeptics\" illogical or are there actual reasons for their stance?", "Are some people bad at everything? Or are they differently abled? What does differently abled mean then?", "Are stars moving? If so, at what time and why?", "Are tea leaves edible? If so why aren't they eaten more often? If not, what harmful effects do they have and how come those effects are not present in teas?", "Are the analogies that are being made between SpiceJet and Kingfisher justified? Why or why not?", "Are the black and white ladybug-like insects in the same family as ladybugs? Why are they black and white?", "Are the following answers to the Question \"How are You or How are You Doing\" ; Correct ?", "Are the references to god “Allah”, “Yahweh” or “Jehovah” just names for the same god, or are they referring to different gods?", "Are the things about Jesus Christ actually true? Is he the son of God? Why didn't God himself come, instead of his son?", "Are there any Kashmiri muslims in Quora who joined indian army? Why did they join? & what is their experiences?", "Are there any characteristics that the Japanese economy has that do not align with the characteristics of the CME model in the VoC approach?", "Are there any conspiracy theories that are probably true? Any conspiracy theories that turned out to be true?", "Are there any detailed explanation about the military formations in Mahabharata other than the Chakravyuha?", "Are there any distinct different benefits between Air National Guard and Air Force Reserve? If so, what are they?", "Are there any ethical differences between stealing from individuals and corporations?", "Are there any facts that proves the Earth is flat?", "Are there any fascinating unknown facts about IC 814 Hijak?", "Are there any functional aspects to the design of military uniforms? What is the use of the (for example) Lanyard, or the belt worn diagonally across the torso in some military uniforms?", "Are there any good reasons why a president Clinton shouldn't appoint Obama to the Supreme Court?", "Are there any health benefits to male circumcision? If there are not, why is it still practised in the US?", "Are there any logical reasons to support Donald Trump?", "Are there any non-Iranian women on Quora who married Iranian men? How is your experience with your in-laws and other Iranians? What are some culture related challenges you face?", "Are there any others who don't like Mozart's works? Why do you dislike them?", "Are there any parallels between the murder of Jon Snow and Julius Caesar? Who would be the Mark Antony?", "Are there any personality characteristics that make pre-crisis superman so different from the N52 connotation?", "Are there any pharmaceutical entrepreneurs who can explain their business' briefly and how did they get there?", "Are there any positive side effects of global warming?", "Are there any scientific reasons behind Hindu temples?", "Are there any sentences in English which cannot be represented in First Order logic?", "Are there any significant voices in the UK who request to stop funding the royal family and to turn its members into simple citizens? If not, why?", "Are there any similarities between mythologies or theologies of different religions?", "Are there any simple explanations of what IS time?", "Are there any specific facts explained by molecule-to-man evolution that cannot be adequately explained by creation theory?", "Are there any subtle differences between a columbian and a Brazilian based on physical appearance? If so, what are they?", "Are there any theories on how a person can become a psychic?", "Are there any theories on what caused the big bang?", "Are there any words that don't have vowels or a \"y\"?", "Are there comparably few French people on Quora? If yes, why?", "Are there good reasons to consider music tuned to a pitch of A = 432 Hz \"better\" to the most commonly used tuning of A = 440 Hz?", "Are there instances when it doesn't matter whether you choose \"affect\" or \"effect\" in a sentence?", "Are there instances when it doesn't matter whether you use \"affect\" or \"effect\" in a sentence?", "Are there many Americans curious about China? Or most of Americans have no interest? And Why?", "Are there modern-day hippies? Where are they and how do they live?", "Are there notable biological differences between people of different races?", "Are there palindromes in languages other than English? If so, what are they?", "Are there people who hate Atal Bihari Vajpayee? Why?", "Are there phenomena that are literally unexplainable by science, or is the unexplainable merely what we don't know yet?", "Are there references in scriptures of India about how people used to manage nature's call?", "Are there secret underworld cultures in particular cities around the world? What are they and how do you access them?", "Are there such things as coincidences, or does everything happen for a reason?", "Are we all unique? Why?", "Are we as a species doomed? If so, why? And if not, why not?", "Are we here for a reason, and, if so, what is that reason?", "Are we not supposed to meet in public areas at night in India? Which law prohibits it? What rights do we have while being inquired by a police officer at night? Do we need to show them our IDs?", "Are we studying for developing our knowledge or for earning money? What is the purpose of education?", "Are you a saint or sadist if you never ever tell a lie, no matter the consequences? What varieties of non-true statements do exist? When and where may each sort be used morally, and if not, why not?", "Areas of application of PLC?", "Aren't scrubs and doctors lab coats supposed to be clean and relatively sterile? Why do so many doctors and nurses wear them out and about?", "Argo (2012 movie): Why were there no Iranian protesters guarding the back of the U.S. embassy during the invasion?", "Arguments and Argumentation: Why do people like to compare and argue on who is better over two great people? Example Lara /Tendulkar", "Around what year did it become popular to label Black Americans as \"African-Americans\" and who coined the term?", "Around when is the Mahindra Gusto 125cc going to be launched in other states such as in the Northest?", "Array declaration and initialization?", "Arrays: How does selection sort work in C?", "Arrow (TV series): How can Oliver hit attackers with his bow and still find it functional?", "Art Conservation and Restoration: What are the conditions of replacing a bulb in a Dan Flavin piece?", "Art History: Why are there no realistic or quality paintings before the Middle Ages?", "Art History; how and why has still life developed in painting?", "Art, chess and snooker - why does art not have the competitiveness that snooker/chess doesn't have?", "Article on benefits of cycling?", "Article related topic in philsophy?", "Artificial Intelligence: How is AI research in Japan different from AI research in the U.S.?", "Artificial vegetative reproduction in plants with special reference to cutting?", "Artwork: What is a picture, photograph or painting that, for you, symbolizes what it means to have or live \"the good life\"?", "As 500 and 1000 rupee note is demonetized, what will RBI do with the collected old notes?", "As ALL matter is created soon after the Big Bang, and in a relatively small area, why doesn't it collapse into a black hole under its own gravitation?", "As Frecuncy increase, magnetic flux inside conductor?", "As Hurricane Matthew bears down on the US, what strategic calculations will be going on in the Clinton and Trump camps?", "As I have heard from sources I want to clarify that does hike messenger works in countries like Europe or America.?", "As I heard that currency was in printing 6 months ago then how can it has Mr. urjit Patel's signature as his name was announced on 23rd August?", "As I understand it the doppler has three sounds: monophasic, biphasic and triphasic. These sounds relate to how well the vascular system is functioning. How do the changes in the vascular system cause the different sounds that are produced?", "As I understand it, Henry Ford, was a big believer in creating a self generating/ increasing marketplace in which his autos were affordable and desired by his factory workers. My question is, did Ford have a view on price, labor costs and materials inflation based on the prior statement? Any good books on Ford's view on Economics specifically?", "As a CEO, how does it feel when you fuck up?", "As a COC player, what would you say if playing the game is not a harmful thing or just a huge loss to your precious time?", "As a Canadian, how do you feel about a Trump presidency?", "As a Chinese person, I have never talked with Japanese people. What is their attitude towards China? What do Japanese on Quora think of China and Chinese people?", "As a Christian what is your view on god?", "As a Democrat, how do you perceive Republicans?", "As a Muslim, why do you think I should accept Islam?", "As a Nigerian Why have you decided not to ever get married?", "As a Pakistani, how would you compare living in Islamabad, Karachi, and Lahore?", "As a Portuguese I'm curious, what do people from various parts of the world think of Portugal and its people?", "As a Republican, what do you like about Hillary Clinton?", "As a Tamil-speaking Indian, I am ashamed to see people and even big people falling on the feet of corrupt leaders. Why are they not ashamed?", "As a Tenant, what are the things to ask the house owner before signing rent agreement?", "As a black American, how have your experiences with racism or race relations differed from those of your parents or grandparents?", "As a boss, what are some signs that people will quit?", "As a citizen of India. What step we should take to solve the issue of brutally deaths of army soldiers and kashmiris, issue of Kashmir conflict?", "As a composer, what is your thought process while composing music for an OST?", "As a data scientist, what could the consequences be for mixing Bayesian and frequentist statistics?", "As a doctor, how are you?", "As a doctor, what is your opinion about the healthcare system in your country?", "As a fellow, as an Intern, or as a professional looking to do something useful, How does working for a social enterprise/ non-profit help you in your professional growth  and if it does - doesn't it contradict the reason behind your choice?", "As a female what would Neanderthal men make of me?", "As a feminist, what anti feminists do you respect?", "As a fully grown bear is so big and heavy, how is it able to outrun a human?", "As a game designer, how does it feel to have had a game you participated in designing adapted to a movie by Uwe Boll?", "As a girl, what do you expect to receive in an online dating site message from a guy?", "As a lesbian, why do I sometimes feel attracted to effeminate men?", "As a liberal, what annoys you about some other liberals/progressives?", "As a medical doctor from the West, how is it to live and work in India?", "As a member of the general category how or in what way has the reservation policy affected your chances?", "As a moderate Democrat, do you understand why Hillary Clinton needed to collect large speaking fees?", "As a multi millionaire how do you feel about the people who helped you get there? Have you rewarded them?", "As a musician/artist, what is it like to have thousands of people sing along with you and your songs when you're performing live?", "As a national belonging to Scheduled Castes, what defines a disrespectful question, answer or content on your class(es) on the social media?", "As a national belonging to Scheduled Castes, what defines a vilifying question, answer or content on your class(es) on the social media?", "As a new graduate student, how does one not become absorbed in the details of research (i.e. getting lost, or off track from thesis)?", "As a non-Filipino, How do you feel about Philippine culture?", "As a non-vegetarian, why do you eat a purposely killed animal for food if you have options?", "As a old school Pokémon gamer how do you feel about Pokémon GO?", "As a parent, what do you think about paying for your children's college tuition?", "As a person in recovery from alcohol and/or drugs, how are you preparing to remain abstinent during the holiday season?", "As a person who believe in God, how scary was The Conjuring 2 for you, your family, or your friends?", "As a physicist my golden rule of verifying my theory is 5 sigma, why do climate scientists state a theory is a fact with less than 2 sigma certainty?", "As a police officer, what is it like to arrest a friend?", "As a professor how would you react to an applicant mentioning their hobby of Quora?", "As a search engine, how do Google and Yahoo actually compare?", "As a soccer (football) referee, what does it feel like to argue with famous players?", "As a son of President of United States of America what special provisions/security am I provided with?", "As a strong Israel supporter, how will Hillary Clinton help advance a Israel-Palestine peace solution?", "As a teacher, how does it feel to make a student cry?", "As a theist, why do you believe God exists?", "As a theist, you wake up in Hell and realise that you worshipped the wrong god all this time. What do you do?", "As a venture capital investor, if you had a chance to invest in Flipkart but passed, what was your rationale?", "As a venture capital investor, if you had a chance to invest in Houzz but passed, what was your rationale?", "As a venture capital investor, if you had a chance to invest in Kabam but passed, what was your rationale?", "As a venture capital investor, if you had a chance to invest in Sunrun but passed, what was your rationale?", "As a venture capital investor, if you had a chance to invest in Tango but passed, what was your rationale?", "As a venture capital investor, if you had a chance to invest in Tesla but passed, what was your rationale?", "As a venture capital investor, if you had an opportunity to invest in Airbnb but passed, what was your rationale?", "As a venture capital investor, if you had an opportunity to invest in Tumblr but passed, what was your rationale?", "As a web developer, why do you like to develop websites from \"scratch\" instead of using CMS like Wordpress, Drupal, or Joomla?", "As a woman how do you feel when you get to know a man thinks of you and masturbates?", "As a woman who has had gastritis, how does it compare to menstrual cramps?", "As a woman, how does it feel to have a penis inside of you?", "As a woman, why are you voting for Donald Trump?", "As acting in movies, singing, dancing are forbidden in Islam, do Indian Muslims see the top Muslim Bollywood stars (Shah Rukh, Aamir and Salman Khans) in bad light?", "As an American, what do you think about the semi-final result of the women's 4*100 relay race in Rio 2016 Olympics?", "As an American, what do you think of letting American citizens not born in the US run for president?", "As an INTJ how does music affect your feelings?", "As an Indian Muslim (or even Indian Christian), how would you explain the differences in Islamic or Christian worship from that of Hindu worship, to a Hindu? Why certain things which Hindus follow are not allowed in your worship, etc?", "As an Indian Muslim, what kind of discrimination did you ever face?", "As an Indian what are your political views?", "As an Indian, What do you think of Donald Trump winning the US election?", "As an Iranian (Persian) who personally knew Arabs how did they treat you?", "As an Israeli Jew, how do you feel while passing an Arab village in Israel?", "As an LEO, how do you feel about open carry?", "As an actor, what is it like to kiss on set?", "As an anti feminist, what feminists do you respect?", "As an atheist, what do you wish theists knew?", "As an educated citizen of our society what would be our role to spread education among unprivileged and uneducated people?", "As an empath can you understand a lot on what goes through a psychopaths mind?", "As an immigrant, how did you feel after arriving in the US?", "As an independent, why should I support Hillary Clinton?", "As an old-ish person, how do you feel when you hear a young person curse 'blindly'?", "As anyone experienced a out of body experience? What was it like?", "As carbon chain size increases, molecule become less and less water soluble. Why?", "As compared to sedans, why do car manufacturers provide only hatchback cars with rear windscreen wipers?", "As far as I remember UAE used to have scarce or no rain. Since when did Dubai, UAE start getting such heavy rain storms?", "As jain has come under minority therefore what are the benefits or services which a minority can enjoy under education, jobs, etc.?", "As many of the Hindu rituals have scientific reasons behind them, what is the scientific reason behind the mandatory head bath for Hindu women after the 4th day of menstruation?", "As measured by the amount of real harm they caused, who were them most notorious American communists in the past 100 years?", "As most of us believe in God, why should we pray for him in so many different ways?", "As neither Trump nor Pence have been elected by the Electoral College yet, what would happen if Trump dies between now and then?", "As of 10/2016, what would Hillary Clinton's cabinet likely look like?", "As of 2013, what street art by Banksy remains in New York City?", "As of 2014, why is Halle Berry no longer considered by some to be an A-list actress? What happened to her career?", "As of 2016 how well does Indian and Pakistani Armed forces fare against each other?", "As of 2016, in what ways is China communist?", "As of July 2015, how is Quip doing?", "As of July 2015, who are Quora's moderators?", "As of now, how many conflicts are happening in the Middle East?", "As part of India’s policy to isolate Pakistan, why shouldn't the BCCI put pressure on the ICC to suspend Pakistan from international cricket?", "As part of his immigration executive action , why didn't President Obama take action to enable more engineers/tech people to immigrate to the U.S.?", "As per Hindu culture earlier both gender used to wear bangles, tika, payal.why is this forced only on women now after marriage.when did the rule change?", "As per Hindu mythology, all the sorrows and happiness are a result of our karma in our past life. If it is so, then why do people pray to God for help in times of distress, knowing that suffering is imminent and predestined? And what is the role of God in our life, if he can't help us?", "As per citizenship (amendment) act, 2003 , India had removed the provision for commonwealth citizenship. What does it signify?", "As per law of attraction what you think that happens then why life doesn't go as we thought it should or as per our plans?", "As per the birth chart is anything good in my life? How will my married life be? (DOB: 17 september 1990, 7.27 am, adoni)?", "As someone who has completed your PhD but is not working in your PhD subject field, what do you think of the benefits of doing your PhD?", "As someone with dwarfism, which term do you prefer, little person, midget or dwarf?", "As space expands, it releases stored up gravitational potential energy, which converts into the intrinsic energy that fills the newly created volume?", "As the commander-in-chief, how much control does the President have over military operations?", "As the earth is sphere how can we say the first sun rises in Japan?", "As the rpm of an engine increases, the torque reduces due to low volumetric efficiency. Due to less air-fuel mixture being burned, power is also reduced. How is the speed increasing?", "As today is 6th of October, 39 years ago at Yom Kippur War. Who do you think really won the war?", "As we know radioactive elements stars from 84 but in periodic table there is one element its radioactive but not 84 promethium why and its no. is 61?", "As we know, good scents and fragrances are oils in nature and soap and detergents are made to remove the oils. How are they selfmade from oils? How does soap, detergent, and toothpaste get mixed with them without being denatured and how do they remain scented after washing?", "Ashlee Vance: What are Elon Musk's political beliefs?", "Ashlee Vance: What did you personally learned from Elon Musk and applied it in your day-to-day life?", "Ashlee Vance: What is Elon Musk afraid of?", "Ashlee Vance: What is Elon Musk's idea of enjoyment?", "Ashlee Vance: What is the difference between me (or any of us) and Elon Musk, that allows him to take risks, make decisions and work tirelessly?", "Ashlee Vance: What political ideology does Elon Musk subscribe to?", "Aside from Psoriatic arthritis what are the long term complications of Psoriasis?", "Aside from accessing patient records, what are other value added services a health information exchange can provide to its clinician users?", "Aside from being 100 years old, what is \"magical\" about Eileen Kramer?", "Aside from cost, why do some Mormons choose to attend University of Utah or USU vs. BYU?", "Aside from funding, what are the obstacles to researching the medical benefits of marijuana in states that have legalized (medical) marijuana?", "Aside from screen size, what is different between the iPhone 6s and 6s Plus?", "Aside from the characters, what are the differences between Ingress and Pokémon GO?", "Asked what a silly question?", "Assassin's Creed (series): What is the meaning of Ezio Auditore De Firenze?", "Assassinations: What happened to Marina Oswald, Lee Harvey Oswald's widow?"]